[{
  "_id": {
    "$oid": "66603705ed43a30f94899288"
  },
  "createdAt": [
    {
      "$date": "2024-06-05T15:29:33.368Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:49.688Z"
  },
  "deleted": false,
  "sector": "IT / ITeS (Information Technology / Information Technology enabled Services)",
  "collegeCategory": "Non-College",
  "subSector": "Data Management",
  "jobProfile": {
    "generalDescription": {
      "text": "A Data Entry Clerk in the IT/ITeS sector inputs data into computer systems. They ensure the accuracy of the data entered. They may also update and maintain information on computer systems. This role is crucial for managing and organizing data. It does not require a college degree.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Data%20Entry%20Clerk-1722425708552.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Data%20Entry%20Clerk-1722944604027.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Data%20Entry%20Clerk-1722944643089.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for a Data Entry Clerk starts with logging into the computer system. They receive data from various sources like paper documents or digital files. They then enter this data into the system, making sure it is accurate. They may also verify and correct any errors in the data. Throughout the day, they might have to update existing records and generate reports."
    },
    "reasonsLiked": [
      {
        "reason": "The job does not require a college degree."
      },
      {
        "reason": "It offers a stable work environment."
      },
      {
        "reason": "The tasks are straightforward and repetitive."
      },
      {
        "reason": "It provides an opportunity to work in the IT sector."
      },
      {
        "reason": "The job can sometimes be done remotely."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The work can be monotonous."
      },
      {
        "reason": "Long hours of sitting can be tiring."
      },
      {
        "reason": "The job may involve tight deadlines."
      },
      {
        "reason": "There is limited room for creativity."
      },
      {
        "reason": "The pay may be lower compared to other IT jobs."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "Students typically need to complete at least 12th pass to become a Data Entry Clerk. In large cities, some employers may prefer candidates with higher education, but it is not always necessary.",
      "trainingNeeded": "Students can benefit from short-term certificate or diploma programs in computer applications or data entry. These programs are available in large cities, medium & small cities, and towns & villages. Basic computer skills and typing speed are important.",
      "priorWorkExperience": "Prior work experience is not always required for this job. However, internships or part-time jobs in offices or IT companies can be helpful. This is true across large cities, medium & small cities, and towns & villages."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "6",
      "reason": "Data entry requires attention to detail and some basic problem-solving skills."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "5",
      "reason": "Basic communication skills are needed to understand instructions and report issues."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "4",
      "reason": "Some data entry tasks may involve numbers, but advanced numerical skills are not usually required."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "2",
      "reason": "The job is mostly repetitive and does not require much creativity."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "3",
      "reason": "Spatial awareness is not a significant part of data entry tasks."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "5",
      "reason": "Some interaction with team members may be needed, but it is not a major part of the job."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "7",
      "reason": "Basic computer skills and familiarity with data entry software are important."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "Good organizational skills are needed to manage and enter data accurately."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "2",
      "reason": "This job does not involve business development or entrepreneurial activities."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "3",
      "reason": "The job involves sitting and typing, with minimal physical effort required."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "3",
      "reason": "This job involves working with computers and data, but it does not involve much hands-on work with physical objects."
    },
    {
      "attribute": "Investigative",
      "score": "4",
      "reason": "This job requires attention to detail and accuracy, but it does not involve much problem-solving or research."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job involves repetitive tasks and does not require creativity or artistic skills."
    },
    {
      "attribute": "Social",
      "score": "3",
      "reason": "This job involves some interaction with team members, but it is mostly independent work."
    },
    {
      "attribute": "Enterprising",
      "score": "2",
      "reason": "This job does not involve leadership or taking risks; it is more about following instructions."
    },
    {
      "attribute": "Conventional",
      "score": "9",
      "reason": "This job involves routine tasks, following set procedures, and working with data, which suits conventional interests."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "8",
      "reason": "Data Entry Clerks usually have fixed working hours, which helps maintain a good work-life balance."
    },
    {
      "attribute": "Achievement",
      "score": "5",
      "reason": "The job involves repetitive tasks, so there are limited opportunities for personal achievement."
    },
    {
      "attribute": "Independence",
      "score": "4",
      "reason": "Data Entry Clerks often follow specific instructions and have limited decision-making power."
    },
    {
      "attribute": "Recognition",
      "score": "3",
      "reason": "This role is often considered entry-level, so recognition and praise may be limited."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Many companies provide a supportive environment for Data Entry Clerks to ensure accuracy and efficiency."
    },
    {
      "attribute": "Compensation",
      "score": "4",
      "reason": "The salary for Data Entry Clerks is generally on the lower side compared to other IT jobs."
    },
    {
      "attribute": "Security",
      "score": "6",
      "reason": "There is moderate job security as data entry is essential, but automation could reduce demand in the future."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Data Management Specialist",
      "description": "This pathway is great for someone who loves working with data and wants to become an expert. To be successful, you need to be detail-oriented and good with computers.",
      "jobRoles": [
        {
          "title": "Data Entry Clerk",
          "years": "0-2"
        },
        {
          "title": "Data Analyst",
          "years": "2-5"
        },
        {
          "title": "Data Management Specialist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "IT Support Specialist",
      "description": "This pathway is perfect for someone who enjoys solving technical problems and helping others. To succeed, you need to be patient and have good communication skills.",
      "jobRoles": [
        {
          "title": "Data Entry Clerk",
          "years": "0-2"
        },
        {
          "title": "Technical Support Specialist",
          "years": "2-5"
        },
        {
          "title": "IT Support Specialist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Database Administrator",
      "description": "This pathway is ideal for someone who wants to manage and organize large amounts of data. To be successful, you need to be organized and have strong problem-solving skills.",
      "jobRoles": [
        {
          "title": "Data Entry Clerk",
          "years": "0-2"
        },
        {
          "title": "Junior Database Administrator",
          "years": "2-5"
        },
        {
          "title": "Database Administrator",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Business Intelligence Analyst",
      "description": "This pathway is good for someone who likes to analyze data to help businesses make decisions. To succeed, you need to be analytical and have good attention to detail.",
      "jobRoles": [
        {
          "title": "Data Entry Clerk",
          "years": "0-2"
        },
        {
          "title": "Business Intelligence Analyst",
          "years": "2-5"
        },
        {
          "title": "Senior Business Intelligence Analyst",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Project Coordinator",
      "description": "This pathway is great for someone who enjoys planning and organizing projects. To be successful, you need to be good at multitasking and have strong organizational skills.",
      "jobRoles": [
        {
          "title": "Data Entry Clerk",
          "years": "0-2"
        },
        {
          "title": "Project Assistant",
          "years": "2-5"
        },
        {
          "title": "Project Coordinator",
          "years": "5-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Data Entry Clerk",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Tata Consultancy Services (TCS)",
        "description": "A leading global IT services, consulting, and business solutions organization.",
        "website": "https://www.tcs.com"
      },
      {
        "name": "Infosys",
        "description": "A multinational corporation that provides business consulting, information technology, and outsourcing services.",
        "website": "https://www.infosys.com"
      },
      {
        "name": "Wipro",
        "description": "A global information technology, consulting, and business process services company.",
        "website": "https://www.wipro.com"
      },
      {
        "name": "HCL Technologies",
        "description": "A next-generation global technology company that helps enterprises reimagine their businesses for the digital age.",
        "website": "https://www.hcltech.com"
      },
      {
        "name": "Tech Mahindra",
        "description": "A leading provider of digital transformation, consulting, and business re-engineering services and solutions.",
        "website": "https://www.techmahindra.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities like Mumbai, Delhi, and Bangalore, employers are often big IT companies, multinational corporations, and large business process outsourcing (BPO) firms. These companies usually have many data entry positions and offer good training and career growth opportunities."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are usually mid-sized IT firms, local BPO companies, and regional offices of larger corporations. These employers may offer a more relaxed work environment and may have fewer data entry positions compared to large cities."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are often small businesses, local government offices, and educational institutions. These employers may have limited data entry positions and may not offer as many growth opportunities as those in larger cities."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "Azure GPT4",
  "languageCode": "en",
  "jobRoleKey": "india_it_ites_information_technology_information_technology_enabled_services_data_management_entry_level_non_college_data_entry_clerk",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66618aa0ce93d791a81af717"
  },
  "createdAt": [
    {
      "$date": "2024-06-06T15:38:32.467Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:54.148Z"
  },
  "deleted": false,
  "sector": "Healthcare",
  "collegeCategory": "Non-College",
  "subSector": "Nursing and Patient Care",
  "jobProfile": {
    "generalDescription": {
      "text": "A Phlebotomist is a healthcare worker who draws blood from patients for tests, transfusions, research, or donations. They work in hospitals, clinics, blood donation centers, and laboratories. They must handle blood samples carefully and ensure proper labeling. They also help patients feel comfortable during the procedure. Phlebotomists play a key role in diagnosing and treating illnesses.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Phlebotomist-1722425771015.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Phlebotomist-1722596185205.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Phlebotomist-1722596204903.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for a Phlebotomist starts with preparing the equipment needed for drawing blood. They greet patients and verify their identities. They then draw blood using needles and collection devices, ensuring the samples are properly labeled. Throughout the day, they may handle multiple patients, ensuring each one is comfortable and informed about the procedure. They also maintain records and may need to transport samples to the lab."
    },
    "reasonsLiked": [
      {
        "reason": "Helping people and making a difference in their health."
      },
      {
        "reason": "Working in a healthcare environment without needing a college degree."
      },
      {
        "reason": "Opportunities to interact with different people every day."
      },
      {
        "reason": "Gaining experience in the medical field, which can lead to other opportunities."
      },
      {
        "reason": "Job stability and demand in the healthcare sector."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Dealing with anxious or difficult patients."
      },
      {
        "reason": "Exposure to blood and potential biohazards."
      },
      {
        "reason": "Standing for long periods during the day."
      },
      {
        "reason": "Repetitive nature of the tasks."
      },
      {
        "reason": "Need to follow strict protocols and procedures."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "To become a Phlebotomist, students usually need to complete 12th pass (higher secondary education). In large cities, some employers may prefer candidates with a science background, but this is not always necessary.",
      "trainingNeeded": "Students typically need to complete a certificate or diploma program in phlebotomy. These programs are available in large cities, medium & small cities, and towns & villages. The duration of these programs can range from a few months to a year. Some hospitals and clinics also offer on-the-job training.",
      "priorWorkExperience": "Prior work experience is not always required, but having some experience in a healthcare setting can be helpful. In large cities, internships or volunteer work in hospitals or clinics can provide valuable experience. In medium & small cities, and towns & villages, students may gain experience by assisting in local clinics or healthcare camps."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "6",
      "reason": "Phlebotomists need to follow protocols and solve minor issues, but the job does not require complex problem-solving."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "8",
      "reason": "Phlebotomists must explain procedures to patients and calm them, requiring good communication skills."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "4",
      "reason": "Basic math skills are needed for measurements and labeling, but advanced numerical skills are not required."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "3",
      "reason": "The job follows standard procedures with little room for creativity."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "5",
      "reason": "Some spatial awareness is needed to handle equipment and find veins, but it is not a primary skill."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "9",
      "reason": "Phlebotomists interact with many patients daily and need strong interpersonal skills to make patients comfortable."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "7",
      "reason": "Phlebotomists must be skilled in using medical equipment and following technical procedures."
    },
    {
      "attribute": "Organizational Skills",
      "score": "6",
      "reason": "Keeping patient records and samples organized is important, but it is not the main focus of the job."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "2",
      "reason": "The job does not involve business management or starting new ventures."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "8",
      "reason": "Phlebotomists need good hand-eye coordination and manual dexterity to draw blood efficiently."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "8",
      "reason": "Phlebotomists work with their hands and use tools to draw blood, which is a practical and hands-on task."
    },
    {
      "attribute": "Investigative",
      "score": "4",
      "reason": "While phlebotomists need to understand medical procedures, their job does not involve much research or problem-solving."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "The job does not require creativity or artistic skills."
    },
    {
      "attribute": "Social",
      "score": "7",
      "reason": "Phlebotomists interact with patients regularly and need good communication skills to make patients feel comfortable."
    },
    {
      "attribute": "Enterprising",
      "score": "3",
      "reason": "The job does not involve much in terms of leading projects or making business decisions."
    },
    {
      "attribute": "Conventional",
      "score": "9",
      "reason": "Phlebotomists follow specific procedures and protocols, making the job highly structured and routine."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "6",
      "reason": "Phlebotomists often work regular hours, but may sometimes need to work early mornings or weekends."
    },
    {
      "attribute": "Achievement",
      "score": "7",
      "reason": "Phlebotomists play a crucial role in patient care by collecting blood samples, which helps in diagnosing diseases."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "Phlebotomists usually work under the supervision of doctors or nurses, so there is limited independence."
    },
    {
      "attribute": "Recognition",
      "score": "5",
      "reason": "While important, phlebotomists may not receive as much recognition as doctors or nurses."
    },
    {
      "attribute": "Supportive Environment",
      "score": "8",
      "reason": "Phlebotomists often work in healthcare settings with supportive teams of medical professionals."
    },
    {
      "attribute": "Compensation",
      "score": "4",
      "reason": "The salary for phlebotomists is generally lower compared to other healthcare jobs."
    },
    {
      "attribute": "Security",
      "score": "7",
      "reason": "There is a steady demand for phlebotomists in healthcare, providing good job security."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Clinical Specialist",
      "description": "This pathway is attractive for those who enjoy working directly with patients and want to specialize in clinical procedures. Success can be achieved by gaining experience and taking additional certifications.",
      "jobRoles": [
        {
          "title": "Phlebotomist",
          "years": "0-2"
        },
        {
          "title": "Senior Phlebotomist",
          "years": "2-5"
        },
        {
          "title": "Clinical Specialist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Healthcare Administration",
      "description": "This pathway is good for those who are interested in the management side of healthcare. Success can be achieved by developing strong organizational and leadership skills.",
      "jobRoles": [
        {
          "title": "Phlebotomist",
          "years": "0-2"
        },
        {
          "title": "Phlebotomy Supervisor",
          "years": "2-5"
        },
        {
          "title": "Healthcare Administrator",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Medical Education and Training",
      "description": "This pathway is ideal for those who love teaching and want to train new healthcare workers. Success can be achieved by gaining experience and becoming a certified trainer.",
      "jobRoles": [
        {
          "title": "Phlebotomist",
          "years": "0-2"
        },
        {
          "title": "Phlebotomy Trainer",
          "years": "2-5"
        },
        {
          "title": "Medical Education Specialist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Laboratory Management",
      "description": "This pathway is suitable for those who are interested in the technical and operational aspects of medical labs. Success can be achieved by gaining technical skills and leadership experience.",
      "jobRoles": [
        {
          "title": "Phlebotomist",
          "years": "0-2"
        },
        {
          "title": "Lab Technician",
          "years": "2-5"
        },
        {
          "title": "Lab Manager",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Patient Care Coordination",
      "description": "This pathway is perfect for those who enjoy helping patients navigate their healthcare journeys. Success can be achieved by developing strong communication and coordination skills.",
      "jobRoles": [
        {
          "title": "Phlebotomist",
          "years": "0-2"
        },
        {
          "title": "Patient Care Coordinator",
          "years": "2-5"
        },
        {
          "title": "Senior Patient Care Coordinator",
          "years": "5-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Phlebotomist",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Apollo Hospitals",
        "description": "A large network of hospitals providing comprehensive healthcare services.",
        "website": "https://www.apollohospitals.com/"
      },
      {
        "name": "Fortis Healthcare",
        "description": "A leading integrated healthcare delivery service provider.",
        "website": "https://www.fortishealthcare.com/"
      },
      {
        "name": "Max Healthcare",
        "description": "A chain of hospitals offering a wide range of medical services.",
        "website": "https://www.maxhealthcare.in/"
      },
      {
        "name": "Manipal Hospitals",
        "description": "One of India's foremost multi-specialty healthcare providers.",
        "website": "https://www.manipalhospitals.com/"
      },
      {
        "name": "Narayana Health",
        "description": "A network of hospitals known for affordable and quality healthcare.",
        "website": "https://www.narayanahealth.org/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, phlebotomists often work in big hospitals, diagnostic centers, and blood banks. These employers usually have advanced medical facilities and a high patient volume."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, phlebotomists can find jobs in local hospitals, clinics, and smaller diagnostic labs. These employers may have fewer resources but still provide essential healthcare services."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, phlebotomists typically work in community health centers, primary healthcare facilities, and small clinics. These employers focus on basic healthcare and may have limited medical equipment."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "Azure GPT4",
  "languageCode": "en",
  "jobRoleKey": "india_healthcare_nursing_and_patient_care_entry_level_non_college_phlebotomist",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66619288b48433a1f167bfbc"
  },
  "createdAt": [
    {
      "$date": "2024-06-06T16:12:16.401Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:54.700Z"
  },
  "deleted": false,
  "sector": "Retail",
  "subSector": "Sales",
  "collegeCategory": "Non-College",
  "jobProfile": {
    "generalDescription": {
      "text": "A Retail Sales Associate helps customers in a store. They answer questions, find products, and make sales. They also keep the store clean and organized. They handle payments and returns. They may also help with stocking shelves.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Retail%20Sales%20Associate-1722425802455.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Retail%20Sales%20Associate-1722597201507.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Retail%20Sales%20Associate-1722597230454.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day starts with checking the store's cleanliness and organizing products. They greet customers and help them find what they need. They answer questions about products and prices. They handle payments at the cash register. They also help with restocking shelves and keeping the store tidy. At the end of the day, they may help count the money and close the store."
    },
    "reasonsLiked": [
      {
        "reason": "You get to meet and help many different people."
      },
      {
        "reason": "The job can be fast-paced and exciting."
      },
      {
        "reason": "You can learn a lot about different products."
      },
      {
        "reason": "There are often opportunities for promotion."
      },
      {
        "reason": "You can develop good communication skills."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The job can be physically tiring."
      },
      {
        "reason": "You may have to work on weekends and holidays."
      },
      {
        "reason": "Some customers can be difficult to deal with."
      },
      {
        "reason": "The pay may be low at the entry level."
      },
      {
        "reason": "Standing for long hours can be uncomfortable."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "Most students typically need to have completed at least 10th pass to get a job as a Retail Sales Associate. In large cities, some employers may prefer 12th pass, but this is not always necessary.",
      "trainingNeeded": "Training is not always required, but it can be helpful. Some students take short-term certificate courses in retail management or sales. These courses are more common in large cities. In medium and small cities, towns, and villages, on-the-job training is more common.",
      "priorWorkExperience": "Prior work experience is not always needed. However, having some experience in customer service or sales can be helpful. In large cities, students might get part-time jobs or internships in retail stores. In smaller cities, towns, and villages, students might help in family shops or local businesses."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "5",
      "reason": "Retail Sales Associates need some logical reasoning to handle customer queries and solve problems, but it is not the main focus of the job."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "9",
      "reason": "Strong communication skills are essential for interacting with customers and understanding their needs."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "6",
      "reason": "Basic math skills are needed for handling transactions and managing inventory, but advanced numerical skills are not required."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "4",
      "reason": "There is limited scope for creativity in this role, as tasks are often routine and follow set procedures."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "3",
      "reason": "Spatial awareness is not a significant part of the job, though it can help in organizing displays and stock."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "10",
      "reason": "Excellent interpersonal skills are crucial for building rapport with customers and providing good service."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "4",
      "reason": "Basic technical skills, such as using a cash register or computer, are needed, but advanced technical knowledge is not required."
    },
    {
      "attribute": "Organizational Skills",
      "score": "7",
      "reason": "Good organizational skills help in managing stock, keeping the store tidy, and ensuring smooth operations."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "3",
      "reason": "This role does not typically involve entrepreneurial tasks, as it focuses more on sales and customer service."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "8",
      "reason": "The job often requires standing for long periods, lifting items, and other physical tasks."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "6",
      "reason": "This job involves practical tasks like stocking shelves and handling products."
    },
    {
      "attribute": "Investigative",
      "score": "3",
      "reason": "This job does not require much problem-solving or research."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job has limited opportunities for creativity or artistic expression."
    },
    {
      "attribute": "Social",
      "score": "8",
      "reason": "This job involves a lot of interaction with customers and helping them find products."
    },
    {
      "attribute": "Enterprising",
      "score": "7",
      "reason": "This job requires persuading customers to buy products and meeting sales targets."
    },
    {
      "attribute": "Conventional",
      "score": "9",
      "reason": "This job involves following set procedures and routines, like handling cash and keeping records."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "7",
      "reason": "Retail Sales Associates often work in shifts, which can provide flexibility but may also include weekends and holidays."
    },
    {
      "attribute": "Achievement",
      "score": "6",
      "reason": "There are opportunities to meet sales targets and earn bonuses, but the tasks can be repetitive."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "The job requires following store policies and working under supervision, with limited decision-making power."
    },
    {
      "attribute": "Recognition",
      "score": "6",
      "reason": "Good performance can be recognized through bonuses and promotions, but it may not always be highly visible."
    },
    {
      "attribute": "Supportive Environment",
      "score": "8",
      "reason": "Retail environments often have team-based work and support from supervisors and colleagues."
    },
    {
      "attribute": "Compensation",
      "score": "5",
      "reason": "The pay is generally modest, but there can be additional earnings through commissions and bonuses."
    },
    {
      "attribute": "Security",
      "score": "7",
      "reason": "Retail jobs are generally stable, especially in large retail chains, but can be affected by economic downturns."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Pathway to Store Manager",
      "description": "This pathway is great for people who enjoy leading teams and managing store operations. Success comes from strong leadership skills and good customer service.",
      "jobRoles": [
        {
          "title": "Retail Sales Associate",
          "years": "0-2"
        },
        {
          "title": "Senior Sales Associate",
          "years": "2-4"
        },
        {
          "title": "Assistant Store Manager",
          "years": "4-7"
        },
        {
          "title": "Store Manager",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Pathway to Visual Merchandiser",
      "description": "This pathway is perfect for creative individuals who enjoy designing store displays. Success comes from creativity and attention to detail.",
      "jobRoles": [
        {
          "title": "Retail Sales Associate",
          "years": "0-2"
        },
        {
          "title": "Visual Merchandising Assistant",
          "years": "2-4"
        },
        {
          "title": "Visual Merchandiser",
          "years": "4-7"
        },
        {
          "title": "Senior Visual Merchandiser",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Pathway to Sales Trainer",
      "description": "This pathway is ideal for those who enjoy teaching and helping others improve their sales skills. Success comes from excellent communication and training abilities.",
      "jobRoles": [
        {
          "title": "Retail Sales Associate",
          "years": "0-2"
        },
        {
          "title": "Sales Team Leader",
          "years": "2-4"
        },
        {
          "title": "Sales Trainer",
          "years": "4-7"
        },
        {
          "title": "Senior Sales Trainer",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Pathway to Inventory Manager",
      "description": "This pathway suits those who are good with numbers and enjoy managing stock levels. Success comes from strong organizational skills and attention to detail.",
      "jobRoles": [
        {
          "title": "Retail Sales Associate",
          "years": "0-2"
        },
        {
          "title": "Inventory Assistant",
          "years": "2-4"
        },
        {
          "title": "Inventory Manager",
          "years": "4-7"
        },
        {
          "title": "Senior Inventory Manager",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Pathway to Customer Service Manager",
      "description": "This pathway is great for those who excel in solving customer issues and ensuring customer satisfaction. Success comes from strong problem-solving skills and empathy.",
      "jobRoles": [
        {
          "title": "Retail Sales Associate",
          "years": "0-2"
        },
        {
          "title": "Customer Service Representative",
          "years": "2-4"
        },
        {
          "title": "Customer Service Supervisor",
          "years": "4-7"
        },
        {
          "title": "Customer Service Manager",
          "years": "7-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Retail Sales Associate",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Reliance Retail",
        "description": "One of the largest retail chains in India, offering a wide range of products from groceries to electronics.",
        "website": "https://www.relianceretail.com"
      },
      {
        "name": "Big Bazaar",
        "description": "A popular hypermarket chain known for its wide variety of goods and affordable prices.",
        "website": "https://www.bigbazaar.com"
      },
      {
        "name": "Shoppers Stop",
        "description": "A leading department store chain offering clothing, accessories, and home products.",
        "website": "https://www.shoppersstop.com"
      },
      {
        "name": "D-Mart",
        "description": "A chain of hypermarkets and supermarkets known for its competitive pricing and extensive product range.",
        "website": "https://www.dmartindia.com"
      },
      {
        "name": "Spencer's Retail",
        "description": "A retail chain offering groceries, fresh food, and general merchandise.",
        "website": "https://www.spencersretail.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are often big retail chains and department stores. These stores are usually located in malls or busy shopping areas. They offer a wide range of products and have many employees."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers can be local retail stores or smaller branches of big retail chains. These stores may be in local markets or smaller shopping centers. They offer a variety of products but may have fewer employees."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually small local shops or family-owned businesses. These stores often focus on essential goods like groceries and clothing. They have a small number of employees and serve the local community."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_retail_sales_entry_level_non_college_retail_sales_associate",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "669e5704cf5c1bbebfcff266"
  },
  "sector": "Automotive",
  "subSector": "Vehicle Maintenance and Repair",
  "createdAt": [
    {
      "$date": "2024-07-22T18:26:36.513Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:47.940Z"
  },
  "deleted": false,
  "jobProfile": {
    "generalDescription": {
      "text": "An Automotive Engineer designs, develops, and tests vehicles. They work on improving vehicle performance, safety, and efficiency. They also solve technical problems and work with other engineers. This role often involves using computer software for design and simulation. They may also work on vehicle maintenance and repair.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Automotive%20Engineer-1722421825923.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Automotive%20Engineer-1722956885368.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Automotive%20Engineer-1722956914342.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for an Automotive Engineer starts with checking emails and planning tasks. They might spend the morning designing vehicle parts using computer software. After lunch, they could be testing vehicle prototypes or analyzing data from tests. They often meet with other engineers to discuss projects. They also write reports on their findings and suggest improvements."
    },
    "reasonsLiked": [
      {
        "reason": "Working with advanced technology and innovative designs."
      },
      {
        "reason": "Opportunities to solve complex problems."
      },
      {
        "reason": "High demand for skilled engineers in the automotive industry."
      },
      {
        "reason": "Potential for good salary and benefits."
      },
      {
        "reason": "Chance to work on exciting projects like electric and autonomous vehicles."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Long hours and tight deadlines."
      },
      {
        "reason": "High-pressure environment."
      },
      {
        "reason": "Need for continuous learning to keep up with new technology."
      },
      {
        "reason": "Possible exposure to hazardous materials during testing."
      },
      {
        "reason": "May require relocation for job opportunities."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Students typically need a Bachelor's degree in Mechanical Engineering, Automotive Engineering, or a related field.",
      "trainingNeeded": "Additional training in computer-aided design (CAD) software and vehicle systems is often required. In large cities, students might have access to specialized automotive training centers. In medium and small cities, online courses and workshops can be useful. In towns and villages, students might need to travel to larger cities for training.",
      "priorWorkExperience": "Internships or part-time jobs in automotive workshops or companies are helpful. In large cities, students might find more opportunities for internships. In medium and small cities, local workshops can provide practical experience. In towns and villages, students might need to seek opportunities in nearby cities."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "9",
      "reason": "Automotive Engineers need to solve complex problems and analyze data to improve vehicle performance."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "7",
      "reason": "They must communicate with team members and write reports, but it is not the main focus of the job."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "8",
      "reason": "They use math to design and test vehicle systems and components."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "7",
      "reason": "They need to think of new ways to improve vehicle designs and solve engineering problems."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "8",
      "reason": "Understanding how parts fit together and work in a 3D space is important for designing vehicles."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "6",
      "reason": "They work in teams, so being able to get along with others is helpful, but not the main focus."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "10",
      "reason": "They must have a strong understanding of engineering principles and be skilled in using technical tools and software."
    },
    {
      "attribute": "Organizational Skills",
      "score": "7",
      "reason": "They need to manage projects and keep track of many details."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "5",
      "reason": "This job is more about working within a company rather than starting a business."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "6",
      "reason": "Some hands-on work may be required, but most of the job involves design and analysis."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "9",
      "reason": "Automotive Engineers work with real-world materials and machinery, which requires hands-on problem-solving."
    },
    {
      "attribute": "Investigative",
      "score": "8",
      "reason": "This job involves diagnosing issues and figuring out how to fix them, which requires strong analytical skills."
    },
    {
      "attribute": "Artistic",
      "score": "3",
      "reason": "There is limited scope for creativity as the job is more focused on technical and mechanical tasks."
    },
    {
      "attribute": "Social",
      "score": "4",
      "reason": "While there is some interaction with clients and team members, most of the work is technical and individual."
    },
    {
      "attribute": "Enterprising",
      "score": "5",
      "reason": "There are opportunities to take initiative and improve processes, but it is not the main focus of the job."
    },
    {
      "attribute": "Conventional",
      "score": "7",
      "reason": "The job follows established procedures and standards, which suits those who prefer structured tasks."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "6",
      "reason": "Automotive engineers often work regular hours, but project deadlines can require extra time."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "This job allows you to see the results of your work in the form of improved vehicle performance and safety."
    },
    {
      "attribute": "Independence",
      "score": "7",
      "reason": "Engineers often work in teams but have the freedom to solve problems and make decisions."
    },
    {
      "attribute": "Recognition",
      "score": "6",
      "reason": "While not always in the spotlight, good work is recognized within the company and industry."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Most companies provide a supportive environment with access to resources and mentorship."
    },
    {
      "attribute": "Compensation",
      "score": "7",
      "reason": "The salary is generally good, especially as you gain experience and expertise."
    },
    {
      "attribute": "Security",
      "score": "8",
      "reason": "The automotive industry is stable, and skilled engineers are always in demand."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Vehicle Design Specialist",
      "description": "This pathway is for those who love creating new car designs. It attracts creative thinkers who enjoy problem-solving and innovation. Success comes from staying updated with the latest design trends and technologies.",
      "jobRoles": [
        {
          "title": "Junior Automotive Engineer",
          "years": "0-2"
        },
        {
          "title": "Automotive Design Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior Design Engineer",
          "years": "5-8"
        },
        {
          "title": "Lead Vehicle Designer",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Vehicle Maintenance Manager",
      "description": "This pathway is for those who enjoy ensuring vehicles run smoothly. It attracts detail-oriented people who like hands-on work. Success comes from gaining experience in vehicle systems and strong management skills.",
      "jobRoles": [
        {
          "title": "Junior Automotive Engineer",
          "years": "0-2"
        },
        {
          "title": "Maintenance Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior Maintenance Engineer",
          "years": "5-8"
        },
        {
          "title": "Vehicle Maintenance Manager",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Automotive Quality Control Specialist",
      "description": "This pathway is for those who want to ensure high-quality vehicle production. It attracts people who are detail-oriented and have a passion for quality. Success comes from understanding quality standards and having strong analytical skills.",
      "jobRoles": [
        {
          "title": "Junior Automotive Engineer",
          "years": "0-2"
        },
        {
          "title": "Quality Control Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior Quality Engineer",
          "years": "5-8"
        },
        {
          "title": "Quality Control Manager",
          "years": "8-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Automotive Engineer",
  "collegeCategory": "College",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Tata Motors",
        "description": "One of the largest automobile manufacturers in India, known for producing cars, trucks, and buses.",
        "website": "https://www.tatamotors.com"
      },
      {
        "name": "Maruti Suzuki",
        "description": "A leading car manufacturer in India, famous for its wide range of affordable and reliable cars.",
        "website": "https://www.marutisuzuki.com"
      },
      {
        "name": "Mahindra & Mahindra",
        "description": "A major player in the automotive industry, producing SUVs, commercial vehicles, and tractors.",
        "website": "https://www.mahindra.com"
      },
      {
        "name": "Ashok Leyland",
        "description": "A key manufacturer of commercial vehicles, including trucks and buses.",
        "website": "https://www.ashokleyland.com"
      },
      {
        "name": "Hyundai Motor India",
        "description": "A subsidiary of the South Korean car manufacturer, known for its popular range of cars in India.",
        "website": "https://www.hyundai.com/in/en"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are often big automobile companies and multinational corporations. They have large offices and factories. They offer many job opportunities and good salaries."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers include regional automobile companies and service centers. They may have smaller offices and factories. They offer decent job opportunities and salaries."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually small garages and local service centers. They have smaller teams and limited resources. They offer fewer job opportunities and lower salaries."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹30,000 - ₹60,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹20,000 - ₹40,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_automotive_vehicle_maintenance_and_repair_entry_level_college_automotive_engineer",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "669f39427c29334ccd8efdc6"
  },
  "sector": "Retail",
  "subSector": "E-commerce",
  "createdAt": [
    {
      "$date": "2024-07-23T05:01:54.048Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:53.676Z"
  },
  "deleted": false,
  "jobProfile": {
    "generalDescription": {
      "text": "An Order Fulfillment Specialist in e-commerce helps process customer orders. They pick items from the warehouse, pack them, and prepare them for shipping. They ensure orders are accurate and delivered on time. They also handle returns and exchanges. This role is important for customer satisfaction.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Order%20Fulfillment%20Specialist-1722436567965.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Order%20Fulfillment%20Specialist-1722597766470.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Order%20Fulfillment%20Specialist-1722597801302.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day starts with checking new orders in the system. The specialist picks items from the warehouse shelves based on the order list. They then pack the items securely and label them for shipping. Throughout the day, they may also handle returns and update inventory records. They often communicate with other team members to ensure smooth operations."
    },
    "reasonsLiked": [
      {
        "reason": "The job does not require a college degree."
      },
      {
        "reason": "It offers hands-on work and keeps you active."
      },
      {
        "reason": "There is a sense of accomplishment in completing orders."
      },
      {
        "reason": "It can be a good entry point into the e-commerce industry."
      },
      {
        "reason": "Some companies offer flexible working hours."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The job can be physically demanding."
      },
      {
        "reason": "It may involve long hours, especially during peak seasons."
      },
      {
        "reason": "Repetitive tasks can become monotonous."
      },
      {
        "reason": "There is pressure to meet deadlines and quotas."
      },
      {
        "reason": "The work environment can be noisy and busy."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "For an Order Fulfillment Specialist role in e-commerce, students typically need to have completed at least 10th pass. In large cities, having completed 12th pass can be more common. In medium and small cities, towns, and villages, 10th pass is usually sufficient.",
      "trainingNeeded": "Students often benefit from short-term training programs. These can include certificate courses in supply chain management, basic computer skills, and customer service. In large cities, there are more options for specialized training programs. In medium and small cities, towns, and villages, local vocational training centers can provide relevant courses.",
      "priorWorkExperience": "Prior work experience is not always required but can be helpful. Part-time jobs or internships in retail, warehousing, or customer service can provide useful experience. In large cities, students might find more opportunities for internships. In medium and small cities, towns, and villages, students might gain experience through family businesses or local shops."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "6",
      "reason": "This job requires some problem-solving to ensure orders are correctly fulfilled."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "7",
      "reason": "Good communication is needed to coordinate with team members and customers."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "5",
      "reason": "Basic math skills are needed for inventory management and order processing."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "3",
      "reason": "This job follows set procedures, so there is limited need for creativity."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "6",
      "reason": "Understanding space is important for organizing and storing products efficiently."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "7",
      "reason": "Working well with others is important for team collaboration and customer service."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "5",
      "reason": "Basic computer skills are needed to use order management systems."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "Being organized is crucial for managing orders and inventory effectively."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "2",
      "reason": "This job does not involve business development or risk-taking."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "8",
      "reason": "The job often involves physical tasks like lifting and moving products."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "8",
      "reason": "This job involves hands-on tasks like picking, packing, and shipping orders."
    },
    {
      "attribute": "Investigative",
      "score": "3",
      "reason": "This job does not require much problem-solving or research."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job does not involve creative tasks or design work."
    },
    {
      "attribute": "Social",
      "score": "5",
      "reason": "This job involves some interaction with team members but not a lot of customer interaction."
    },
    {
      "attribute": "Enterprising",
      "score": "4",
      "reason": "This job does not involve leading projects or making business decisions."
    },
    {
      "attribute": "Conventional",
      "score": "9",
      "reason": "This job involves following set procedures and routines."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "7",
      "reason": "This job usually has fixed hours, which helps maintain a good work-life balance."
    },
    {
      "attribute": "Achievement",
      "score": "6",
      "reason": "You can feel a sense of accomplishment by completing orders accurately and on time."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "The job involves following set procedures, so there is limited room for independent decision-making."
    },
    {
      "attribute": "Recognition",
      "score": "4",
      "reason": "Recognition is usually limited as this is an entry-level position with routine tasks."
    },
    {
      "attribute": "Supportive Environment",
      "score": "8",
      "reason": "Retail and e-commerce companies often provide training and support to help employees succeed."
    },
    {
      "attribute": "Compensation",
      "score": "5",
      "reason": "The pay is generally modest, but it is fair for an entry-level position without a college degree."
    },
    {
      "attribute": "Security",
      "score": "7",
      "reason": "There is a steady demand for order fulfillment specialists, providing reasonable job security."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Warehouse Management",
      "description": "This pathway is great for people who like organizing and managing stock. Success comes from being detail-oriented and good at managing time.",
      "jobRoles": [
        {
          "title": "Order Fulfillment Specialist",
          "years": "0-2"
        },
        {
          "title": "Warehouse Supervisor",
          "years": "2-5"
        },
        {
          "title": "Warehouse Manager",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Customer Service",
      "description": "This pathway is ideal for those who enjoy helping customers and solving problems. Success comes from being patient and having good communication skills.",
      "jobRoles": [
        {
          "title": "Order Fulfillment Specialist",
          "years": "0-2"
        },
        {
          "title": "Customer Service Representative",
          "years": "2-4"
        },
        {
          "title": "Customer Service Manager",
          "years": "4-10"
        }
      ]
    },
    {
      "pathwayTitle": "Inventory Control",
      "description": "This pathway suits people who are good with numbers and like keeping track of stock. Success comes from being accurate and having good analytical skills.",
      "jobRoles": [
        {
          "title": "Order Fulfillment Specialist",
          "years": "0-2"
        },
        {
          "title": "Inventory Coordinator",
          "years": "2-4"
        },
        {
          "title": "Inventory Manager",
          "years": "4-10"
        }
      ]
    },
    {
      "pathwayTitle": "Logistics and Supply Chain",
      "description": "This pathway is for those who like planning and making sure goods move smoothly. Success comes from being organized and good at problem-solving.",
      "jobRoles": [
        {
          "title": "Order Fulfillment Specialist",
          "years": "0-2"
        },
        {
          "title": "Logistics Coordinator",
          "years": "2-5"
        },
        {
          "title": "Supply Chain Manager",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "E-commerce Operations",
      "description": "This pathway is perfect for those who are interested in online retail and technology. Success comes from being tech-savvy and adaptable.",
      "jobRoles": [
        {
          "title": "Order Fulfillment Specialist",
          "years": "0-2"
        },
        {
          "title": "E-commerce Coordinator",
          "years": "2-4"
        },
        {
          "title": "E-commerce Operations Manager",
          "years": "4-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Order Fulfillment Specialist",
  "collegeCategory": "Non-College",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Amazon India",
        "description": "A major e-commerce company offering a wide range of products.",
        "website": "https://www.amazon.in"
      },
      {
        "name": "Flipkart",
        "description": "One of India's leading e-commerce platforms.",
        "website": "https://www.flipkart.com"
      },
      {
        "name": "Myntra",
        "description": "An online fashion and lifestyle store.",
        "website": "https://www.myntra.com"
      },
      {
        "name": "Snapdeal",
        "description": "An online marketplace offering various products.",
        "website": "https://www.snapdeal.com"
      },
      {
        "name": "BigBasket",
        "description": "An online grocery delivery service.",
        "website": "https://www.bigbasket.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually big e-commerce companies and large retail chains. They have large warehouses and need many workers to handle orders."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often regional e-commerce companies and local retail stores. They have smaller warehouses but still need order fulfillment staff."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually small local businesses or regional branches of larger companies. They have small storage areas and need fewer workers."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_retail_e_commerce_entry_level_non_college_order_fulfillment_specialist",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "669f39457c29334ccd8efdc7"
  },
  "sector": "Retail",
  "subSector": "E-commerce",
  "createdAt": [
    {
      "$date": "2024-07-23T05:01:57.797Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:50.919Z"
  },
  "deleted": false,
  "jobProfile": {
    "generalDescription": {
      "text": "An Ecommerce Warehouse Associate helps in managing the inventory in a warehouse. They receive goods, check them, and store them properly. They also pick and pack orders for customers. They ensure that the warehouse is clean and organized. They may also help in loading and unloading trucks.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Ecommerce%20Warehouse%20Associate-1722436496480.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Ecommerce%20Warehouse%20Associate-1722849647771.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Ecommerce%20Warehouse%20Associate-1722849679177.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day starts with checking the inventory and receiving new shipments. The associate checks the goods for any damage and stores them in the right place. They then pick items from the shelves to fulfill customer orders. They pack these items carefully and prepare them for shipping. Throughout the day, they keep the warehouse clean and organized. They may also help in loading and unloading trucks when needed."
    },
    "reasonsLiked": [
      {
        "reason": "The job does not require a college degree."
      },
      {
        "reason": "It offers a chance to stay active and move around."
      },
      {
        "reason": "There is a sense of accomplishment in fulfilling customer orders."
      },
      {
        "reason": "The work environment is usually friendly and team-oriented."
      },
      {
        "reason": "There are opportunities for overtime and extra pay."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The job can be physically demanding."
      },
      {
        "reason": "It may involve long hours, especially during busy seasons."
      },
      {
        "reason": "The work can become repetitive."
      },
      {
        "reason": "The warehouse can be noisy and sometimes uncomfortable."
      },
      {
        "reason": "There is a risk of injury if safety rules are not followed."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "For an Ecommerce Warehouse Associate role, students typically need to have completed at least 10th pass. In large cities, some employers may prefer 12th pass, but it is not always necessary. In medium and small cities, towns, and villages, 10th pass is usually sufficient.",
      "trainingNeeded": "Training for this role often includes on-the-job training provided by the employer. Some students may benefit from short-term certificate programs in warehouse management or logistics. These programs are more commonly available in large cities. In medium and small cities, towns, and villages, students may rely more on employer-provided training.",
      "priorWorkExperience": "Prior work experience is not always required for this role. However, having some experience in a similar job, like working in a retail store or another warehouse, can be helpful. In large cities, employers might prefer candidates with some experience, while in medium and small cities, towns, and villages, employers are more likely to hire freshers and provide necessary training."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "5",
      "reason": "This job requires some problem-solving skills to organize and manage inventory."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "6",
      "reason": "Basic communication is needed to coordinate with team members and supervisors."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "4",
      "reason": "Some basic math skills are needed for counting inventory and processing orders."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "2",
      "reason": "This job follows set procedures and does not require much creative thinking."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "7",
      "reason": "Good spatial awareness is important for organizing and storing items efficiently."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "6",
      "reason": "Working well with others is important in a team environment."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "5",
      "reason": "Basic computer skills are needed to use inventory management systems."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "Strong organizational skills are crucial for managing inventory and ensuring smooth operations."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "3",
      "reason": "This job does not involve much decision-making or risk-taking."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "9",
      "reason": "This job requires a lot of physical activity, including lifting and moving items."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "8",
      "reason": "This job involves physical tasks like packing, sorting, and moving items, which are hands-on activities."
    },
    {
      "attribute": "Investigative",
      "score": "3",
      "reason": "This job does not require much problem-solving or research work."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job does not involve creativity or artistic skills."
    },
    {
      "attribute": "Social",
      "score": "4",
      "reason": "This job involves some interaction with team members but not much customer interaction."
    },
    {
      "attribute": "Enterprising",
      "score": "3",
      "reason": "This job does not involve leading projects or making business decisions."
    },
    {
      "attribute": "Conventional",
      "score": "7",
      "reason": "This job involves following set procedures and routines, which suits conventional interests."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "7",
      "reason": "This job usually has fixed hours, which helps maintain a good balance between work and personal life."
    },
    {
      "attribute": "Achievement",
      "score": "5",
      "reason": "The job involves routine tasks, so there are limited opportunities for personal achievement."
    },
    {
      "attribute": "Independence",
      "score": "4",
      "reason": "Tasks are often assigned by supervisors, so there is limited independence."
    },
    {
      "attribute": "Recognition",
      "score": "3",
      "reason": "Recognition is usually limited as the job involves standard tasks that are often not individually acknowledged."
    },
    {
      "attribute": "Supportive Environment",
      "score": "6",
      "reason": "The work environment can be supportive, with team members often helping each other."
    },
    {
      "attribute": "Compensation",
      "score": "5",
      "reason": "The pay is generally average for entry-level positions without a college degree."
    },
    {
      "attribute": "Security",
      "score": "8",
      "reason": "E-commerce is growing in India, which provides good job security for warehouse associates."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Warehouse Management",
      "description": "This pathway is great for those who like organizing and managing stock. Success comes from being detail-oriented and good at managing people.",
      "jobRoles": [
        {
          "title": "Ecommerce Warehouse Associate",
          "years": "0-2"
        },
        {
          "title": "Warehouse Supervisor",
          "years": "2-5"
        },
        {
          "title": "Warehouse Manager",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Logistics and Supply Chain",
      "description": "This pathway is ideal for those who enjoy planning and coordinating shipments. Success comes from being good at problem-solving and communication.",
      "jobRoles": [
        {
          "title": "Ecommerce Warehouse Associate",
          "years": "0-2"
        },
        {
          "title": "Logistics Coordinator",
          "years": "2-5"
        },
        {
          "title": "Supply Chain Manager",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Inventory Control",
      "description": "This pathway suits those who are good with numbers and inventory tracking. Success comes from being accurate and having strong analytical skills.",
      "jobRoles": [
        {
          "title": "Ecommerce Warehouse Associate",
          "years": "0-2"
        },
        {
          "title": "Inventory Specialist",
          "years": "2-5"
        },
        {
          "title": "Inventory Control Manager",
          "years": "5-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Ecommerce Warehouse Associate",
  "collegeCategory": "Non-College",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Amazon India",
        "description": "A major e-commerce company offering a wide range of products.",
        "website": "https://www.amazon.in"
      },
      {
        "name": "Flipkart",
        "description": "One of India's leading e-commerce platforms.",
        "website": "https://www.flipkart.com"
      },
      {
        "name": "Myntra",
        "description": "An online fashion and lifestyle store.",
        "website": "https://www.myntra.com"
      },
      {
        "name": "Snapdeal",
        "description": "An online marketplace offering various products.",
        "website": "https://www.snapdeal.com"
      },
      {
        "name": "BigBasket",
        "description": "An online grocery delivery service.",
        "website": "https://www.bigbasket.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities like Mumbai, Delhi, and Bangalore, employers are usually big e-commerce companies with large warehouses. They offer better pay and more job opportunities."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often regional e-commerce companies or local branches of big companies. They offer stable jobs but may have fewer opportunities for growth."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually small local businesses or regional e-commerce companies. Jobs may be limited and pay may be lower compared to larger cities."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_retail_e_commerce_entry_level_non_college_ecommerce_warehouse_associate",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "669f39fe7c29334ccd8efdc8"
  },
  "sector": "Healthcare",
  "subSector": "Healthcare Administration",
  "createdAt": [
    {
      "$date": "2024-07-23T05:05:02.422Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:52.623Z"
  },
  "deleted": false,
  "jobProfile": {
    "generalDescription": {
      "text": "A Medical Records Technician manages patient records in a healthcare setting. They ensure records are accurate and up-to-date. They also handle patient information with confidentiality. This role involves using computer systems to store and organize data. They may also assist in retrieving records for medical staff.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Medical%20Records%20Technician-1722425745970.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Medical%20Records%20Technician-1722842875337.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Medical%20Records%20Technician-1722842915391.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for a Medical Records Technician starts with checking emails and messages for any urgent requests. They spend a lot of time on the computer updating patient records. They also organize and file paper records. Throughout the day, they may receive requests from doctors or nurses for specific patient information. They ensure all data is entered correctly and securely."
    },
    "reasonsLiked": [
      {
        "reason": "The job is stable and offers regular hours."
      },
      {
        "reason": "It involves working in a healthcare environment, which can be rewarding."
      },
      {
        "reason": "The role requires attention to detail, which some people enjoy."
      },
      {
        "reason": "There is a sense of responsibility in handling important patient information."
      },
      {
        "reason": "Opportunities for advancement in healthcare administration are available."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The job can be repetitive and monotonous."
      },
      {
        "reason": "It requires long hours of computer work, which can be tiring."
      },
      {
        "reason": "Handling confidential information can be stressful."
      },
      {
        "reason": "There is limited patient interaction, which some may find unfulfilling."
      },
      {
        "reason": "The work environment can be quiet and isolated."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "Students typically need to complete 12th pass (higher secondary education) to qualify for this job. This is common across Large Cities, Medium & Small Cities, and Towns & Villages.",
      "trainingNeeded": "Students often need to complete certificate or diploma programs in Medical Records Technology or Health Information Management. These programs are available in Large Cities and some Medium & Small Cities. In Towns & Villages, students might need to travel to nearby cities for these programs.",
      "priorWorkExperience": "Prior work experience is not always required, but internships or part-time jobs in hospitals or clinics can be helpful. This is more common in Large Cities and Medium & Small Cities. In Towns & Villages, opportunities for internships might be fewer, so students may need to look for experience in nearby cities."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "8",
      "reason": "Medical Records Technicians need to organize and analyze patient records accurately."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "6",
      "reason": "They must communicate with healthcare staff and sometimes with patients."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "5",
      "reason": "Basic math skills are needed for managing records and billing information."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "3",
      "reason": "The job is more about following procedures than creating new ideas."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "2",
      "reason": "This job does not require much spatial awareness."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "7",
      "reason": "Good interpersonal skills help in working with healthcare teams and patients."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "8",
      "reason": "Proficiency with computers and medical software is very important."
    },
    {
      "attribute": "Organizational Skills",
      "score": "9",
      "reason": "Excellent organizational skills are needed to manage and maintain accurate records."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "2",
      "reason": "This job does not involve starting or running a business."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "3",
      "reason": "The job is mostly desk-based and does not require much physical activity."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "4",
      "reason": "This job involves working with computers and records, not hands-on tasks or machinery."
    },
    {
      "attribute": "Investigative",
      "score": "6",
      "reason": "This job requires attention to detail and accuracy, but it does not involve scientific research or problem-solving."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job does not involve creativity or artistic skills."
    },
    {
      "attribute": "Social",
      "score": "5",
      "reason": "This job involves some interaction with healthcare staff but not much direct patient contact."
    },
    {
      "attribute": "Enterprising",
      "score": "3",
      "reason": "This job does not involve leading others or making business decisions."
    },
    {
      "attribute": "Conventional",
      "score": "9",
      "reason": "This job involves routine tasks, following procedures, and working with data, which suits conventional interests."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "8",
      "reason": "Medical Records Technicians often have regular working hours, which helps maintain a good work-life balance."
    },
    {
      "attribute": "Achievement",
      "score": "6",
      "reason": "This job allows you to contribute to the healthcare system, but it may not offer many opportunities for personal achievement."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "While there is some independence in managing records, the job often requires following strict guidelines and working under supervision."
    },
    {
      "attribute": "Recognition",
      "score": "4",
      "reason": "This role is crucial but often goes unnoticed, so recognition is limited."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Healthcare settings usually have a supportive environment, but it can vary depending on the workplace."
    },
    {
      "attribute": "Compensation",
      "score": "5",
      "reason": "The salary for this role is moderate and may not be very high, especially at entry-level."
    },
    {
      "attribute": "Security",
      "score": "9",
      "reason": "Healthcare jobs are generally stable and in demand, providing good job security."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Healthcare Data Analyst",
      "description": "This pathway is great for those who love working with data and numbers. To be successful, you should learn data analysis tools and techniques.",
      "jobRoles": [
        {
          "title": "Medical Records Technician",
          "years": "0-2"
        },
        {
          "title": "Junior Data Analyst",
          "years": "2-5"
        },
        {
          "title": "Healthcare Data Analyst",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Health Information Manager",
      "description": "This pathway is ideal for those who want to manage and organize health information. To succeed, you should develop strong organizational and leadership skills.",
      "jobRoles": [
        {
          "title": "Medical Records Technician",
          "years": "0-3"
        },
        {
          "title": "Senior Medical Records Technician",
          "years": "3-6"
        },
        {
          "title": "Health Information Manager",
          "years": "6-10"
        }
      ]
    },
    {
      "pathwayTitle": "Medical Coding Specialist",
      "description": "This pathway is perfect for those who are detail-oriented and interested in medical coding. To excel, you should get certified in medical coding and stay updated with coding standards.",
      "jobRoles": [
        {
          "title": "Medical Records Technician",
          "years": "0-2"
        },
        {
          "title": "Junior Medical Coder",
          "years": "2-4"
        },
        {
          "title": "Medical Coding Specialist",
          "years": "4-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Medical Records Technician",
  "collegeCategory": "Non-College",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Apollo Hospitals",
        "description": "One of the largest healthcare groups in India, offering a wide range of medical services.",
        "website": "https://www.apollohospitals.com/"
      },
      {
        "name": "Fortis Healthcare",
        "description": "A leading integrated healthcare delivery service provider in India.",
        "website": "https://www.fortishealthcare.com/"
      },
      {
        "name": "Max Healthcare",
        "description": "A network of hospitals providing comprehensive healthcare services.",
        "website": "https://www.maxhealthcare.in/"
      },
      {
        "name": "Manipal Hospitals",
        "description": "One of India's foremost multi-specialty healthcare providers.",
        "website": "https://www.manipalhospitals.com/"
      },
      {
        "name": "Narayana Health",
        "description": "A chain of multi-specialty hospitals in India.",
        "website": "https://www.narayanahealth.org/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually big hospitals, healthcare networks, and specialized medical centers. These employers often have advanced facilities and a large number of patients."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often regional hospitals, clinics, and healthcare centers. These places may have fewer patients compared to large cities but still offer good opportunities."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually small clinics, primary health centers, and community health facilities. These employers may have limited resources but play a crucial role in local healthcare."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_healthcare_healthcare_administration_entry_level_non_college_medical_records_technician",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "669f90d36bc019b43a54d779"
  },
  "sector": "Healthcare",
  "subSector": "Nursing and Patient Care",
  "createdAt": [
    {
      "$date": "2024-07-23T11:15:31.671Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:48.553Z"
  },
  "deleted": false,
  "jobProfile": {
    "generalDescription": {
      "text": "A Certified Nursing Assistant (CNA) helps patients with daily activities like bathing, dressing, and eating. They also take vital signs and assist nurses with medical tasks. CNAs provide basic care and comfort to patients. They work in hospitals, nursing homes, and other healthcare settings. This role does not require a college degree.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Certified%20Nursing%20Assistant%20-CNA--1722424238379.png",
      "mediaURLs": {
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Certified%20Nursing%20Assistant%20-CNA-_Female-1722594543817.png",
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Certified%20Nursing%20Assistant%20-CNA-_Male-1722594549663.png"
      }
    },
    "dayInTheLife": {
      "text": "A CNA starts the day by checking on patients and helping them get out of bed. They assist with bathing, dressing, and grooming. Throughout the day, they take vital signs like blood pressure and temperature. They help patients with meals and ensure they take their medications. CNAs also assist nurses with medical procedures and keep patient rooms clean and organized."
    },
    "reasonsLiked": [
      {
        "reason": "Helping people and making a difference in their lives."
      },
      {
        "reason": "Building close relationships with patients."
      },
      {
        "reason": "Learning about healthcare and gaining experience."
      },
      {
        "reason": "Job stability and demand in the healthcare sector."
      },
      {
        "reason": "Opportunities for career advancement in nursing."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Physically demanding and requires long hours on your feet."
      },
      {
        "reason": "Dealing with difficult or uncooperative patients."
      },
      {
        "reason": "Exposure to illnesses and infections."
      },
      {
        "reason": "Emotional stress from working with sick or dying patients."
      },
      {
        "reason": "Low pay compared to other healthcare jobs."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "To become a Certified Nursing Assistant (CNA) in India, students typically need to have completed at least 10th pass. In large cities, some employers may prefer candidates who have completed 12th pass.",
      "trainingNeeded": "Students need to complete a CNA training program. These programs are available as certificate or diploma courses. In large cities, these programs are often offered by hospitals and nursing schools. In medium and small cities, as well as towns and villages, students may need to travel to larger cities to find accredited programs.",
      "priorWorkExperience": "Prior work experience is not usually required to become a CNA. However, volunteering at hospitals or clinics can be helpful. In large cities, there are more opportunities for volunteering. In medium and small cities, towns, and villages, students may need to look for opportunities in nearby larger cities."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "6",
      "reason": "CNAs need to solve problems and make quick decisions, but the job does not require advanced analytical skills."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "8",
      "reason": "Good communication is important for interacting with patients and healthcare staff."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "4",
      "reason": "Basic math skills are needed for tasks like measuring vital signs, but advanced numerical skills are not required."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "3",
      "reason": "The job follows set procedures and protocols, with limited scope for creativity."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "5",
      "reason": "Some spatial awareness is needed for tasks like moving patients and setting up equipment."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "9",
      "reason": "Strong interpersonal skills are crucial for providing compassionate care and working well with others."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "7",
      "reason": "CNAs use medical equipment and technology, so some technical skills are necessary."
    },
    {
      "attribute": "Organizational Skills",
      "score": "6",
      "reason": "CNAs need to manage their time and tasks efficiently, but they often follow a set schedule."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "2",
      "reason": "This job does not involve business management or starting new ventures."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "10",
      "reason": "The job is physically demanding, requiring strength and dexterity for tasks like lifting patients and performing basic care activities."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "8",
      "reason": "Certified Nursing Assistants (CNAs) work directly with patients, helping with daily activities and basic medical care. This job involves hands-on tasks and practical problem-solving."
    },
    {
      "attribute": "Investigative",
      "score": "4",
      "reason": "CNAs do not typically engage in research or deep problem-solving. Their tasks are more routine and practical, rather than investigative."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job does not involve creative tasks or artistic expression. It focuses on following procedures and providing care."
    },
    {
      "attribute": "Social",
      "score": "9",
      "reason": "CNAs interact with patients and their families regularly. They need good communication skills and empathy to provide care and support."
    },
    {
      "attribute": "Enterprising",
      "score": "3",
      "reason": "This role does not involve much in terms of leadership or business activities. It is more about following instructions and providing care."
    },
    {
      "attribute": "Conventional",
      "score": "7",
      "reason": "CNAs follow established procedures and protocols in their daily tasks. The job requires attention to detail and adherence to rules."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "5",
      "reason": "CNAs often work long hours, including nights and weekends, which can make balancing work and personal life challenging."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "Helping patients and seeing their improvement can be very rewarding and fulfilling."
    },
    {
      "attribute": "Independence",
      "score": "4",
      "reason": "CNAs usually work under the supervision of nurses and doctors, so there is limited independence."
    },
    {
      "attribute": "Recognition",
      "score": "6",
      "reason": "While CNAs are essential to patient care, they may not always receive as much recognition as other healthcare professionals."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Healthcare teams often work closely together, providing a supportive environment for CNAs."
    },
    {
      "attribute": "Compensation",
      "score": "5",
      "reason": "The salary for CNAs is generally lower compared to other healthcare jobs, but it is a good starting point in the healthcare field."
    },
    {
      "attribute": "Security",
      "score": "9",
      "reason": "There is a high demand for healthcare workers, including CNAs, which provides good job security."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Specialized Nursing Assistant",
      "description": "This pathway is attractive for those who want to focus on specific areas of patient care. It suits employees who enjoy detailed work and want to become experts in a particular field. Success can be achieved by gaining certifications and attending specialized training.",
      "jobRoles": [
        {
          "title": "Certified Nursing Assistant (CNA)",
          "years": "0-2"
        },
        {
          "title": "Specialized Nursing Assistant",
          "years": "2-5"
        },
        {
          "title": "Senior Specialized Nursing Assistant",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Nursing Supervisor",
      "description": "This pathway is ideal for those who have leadership skills and want to manage a team. It attracts employees who are good at organizing and communicating. Success can be achieved by gaining experience and taking leadership courses.",
      "jobRoles": [
        {
          "title": "Certified Nursing Assistant (CNA)",
          "years": "0-3"
        },
        {
          "title": "Nursing Team Leader",
          "years": "3-6"
        },
        {
          "title": "Nursing Supervisor",
          "years": "6-10"
        }
      ]
    },
    {
      "pathwayTitle": "Healthcare Administrator",
      "description": "This pathway is for those who want to move into administrative roles in healthcare. It suits employees who are good at planning and managing resources. Success can be achieved by studying healthcare management and gaining experience in administrative tasks.",
      "jobRoles": [
        {
          "title": "Certified Nursing Assistant (CNA)",
          "years": "0-3"
        },
        {
          "title": "Administrative Assistant",
          "years": "3-6"
        },
        {
          "title": "Healthcare Administrator",
          "years": "6-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Certified Nursing Assistant (CNA)",
  "collegeCategory": "Non-College",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Apollo Hospitals",
        "description": "One of the largest healthcare groups in India, providing a wide range of medical services.",
        "website": "https://www.apollohospitals.com/"
      },
      {
        "name": "Fortis Healthcare",
        "description": "A leading integrated healthcare delivery service provider in India.",
        "website": "https://www.fortishealthcare.com/"
      },
      {
        "name": "Max Healthcare",
        "description": "A major hospital chain offering comprehensive medical care across India.",
        "website": "https://www.maxhealthcare.in/"
      },
      {
        "name": "Manipal Hospitals",
        "description": "One of India's foremost multi-specialty healthcare providers.",
        "website": "https://www.manipalhospitals.com/"
      },
      {
        "name": "Narayana Health",
        "description": "A network of hospitals providing affordable healthcare services.",
        "website": "https://www.narayanahealth.org/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually big hospitals and healthcare chains. These employers offer modern facilities and a wide range of medical services. They often have many patients and a high demand for nursing assistants."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often smaller hospitals and clinics. These employers provide essential healthcare services to the local population. They may have fewer resources than big city hospitals but still need skilled nursing assistants."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually local health centers and small clinics. These employers focus on basic healthcare and preventive services. They play a crucial role in providing medical care to rural communities and often have a close relationship with their patients."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_healthcare_nursing_and_patient_care_entry_level_non_college_certified_nursing_assistant_cna",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "669fc76cf15dc1a0d6e58291"
  },
  "sector": "Automotive",
  "subSector": "Vehicle Manufacturing",
  "createdAt": [
    {
      "$date": "2024-07-23T15:08:28.554Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:52.042Z"
  },
  "deleted": false,
  "jobProfile": {
    "generalDescription": {
      "text": "A Manufacturing Engineer in the automotive sector designs and improves manufacturing processes. They ensure that vehicles are made efficiently and meet quality standards. They work with other engineers and technicians. They solve problems that happen during production. They also help in planning and setting up new manufacturing systems.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Manufacturing%20Engineer-1722436525233.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Manufacturing%20Engineer-1722957193050.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Manufacturing%20Engineer-1722957224162.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for a Manufacturing Engineer starts with checking the production schedule. They review any issues from the previous day and plan how to fix them. They spend time on the factory floor, observing and analyzing the manufacturing process. They meet with other engineers and team members to discuss improvements. They also work on designing new tools or systems to make production better."
    },
    "reasonsLiked": [
      {
        "reason": "Opportunity to work with advanced technology."
      },
      {
        "reason": "Challenging and problem-solving work."
      },
      {
        "reason": "Good salary and benefits."
      },
      {
        "reason": "Chance to see the direct impact of your work."
      },
      {
        "reason": "Working in a team environment."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Long hours and tight deadlines."
      },
      {
        "reason": "High-pressure environment."
      },
      {
        "reason": "Need to be on the factory floor, which can be noisy and dirty."
      },
      {
        "reason": "Dealing with unexpected problems can be stressful."
      },
      {
        "reason": "Requires continuous learning and updating skills."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Students typically need a degree in Mechanical Engineering, Manufacturing Engineering, or Industrial Engineering.",
      "trainingNeeded": "Additional training in CAD software, Six Sigma, and Lean Manufacturing is helpful. In large cities, students might have access to specialized workshops and internships. In medium and small cities, online courses and local industry partnerships can be useful. In towns and villages, practical experience through local workshops or small-scale industries is important.",
      "priorWorkExperience": "Internships or part-time jobs in manufacturing settings are valuable. In large cities, students may find opportunities in big automotive companies. In medium and small cities, local manufacturing firms offer good experience. In towns and villages, working in small workshops or family-owned businesses can provide practical skills."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "9",
      "reason": "Manufacturing Engineers need to solve complex problems and improve processes."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "7",
      "reason": "They must communicate with team members and write reports."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "8",
      "reason": "They use math to design and analyze manufacturing processes."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "6",
      "reason": "They need to find new ways to improve efficiency, but the role is more about applying existing methods."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "7",
      "reason": "Understanding the layout of manufacturing plants and machinery is important."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "6",
      "reason": "They work in teams but do not need to interact with customers often."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "9",
      "reason": "They must understand and work with various manufacturing technologies and tools."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "They need to manage projects and ensure that processes run smoothly."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "4",
      "reason": "This role is more about working within a company rather than starting a business."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "5",
      "reason": "Some physical work may be required, but it is not the main focus of the job."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "9",
      "reason": "Manufacturing Engineers work with machines, tools, and materials to build vehicles. This job involves hands-on activities and practical problem-solving."
    },
    {
      "attribute": "Investigative",
      "score": "7",
      "reason": "This job requires analyzing data, solving engineering problems, and improving manufacturing processes. It involves a good amount of research and technical knowledge."
    },
    {
      "attribute": "Artistic",
      "score": "3",
      "reason": "The job is more focused on technical and practical tasks rather than creative or artistic activities."
    },
    {
      "attribute": "Social",
      "score": "5",
      "reason": "While there is some teamwork and communication involved, the job is not primarily focused on social interactions."
    },
    {
      "attribute": "Enterprising",
      "score": "6",
      "reason": "There are opportunities to lead projects and make decisions, but the job is more technical than business-oriented."
    },
    {
      "attribute": "Conventional",
      "score": "8",
      "reason": "The job involves following established procedures, standards, and guidelines in manufacturing processes. It requires attention to detail and adherence to rules."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "6",
      "reason": "Manufacturing Engineers often work regular hours, but sometimes need to work overtime to meet deadlines."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "This job allows you to see the direct results of your work in the form of vehicles produced."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "While there is some independence, you often work as part of a team and follow set processes."
    },
    {
      "attribute": "Recognition",
      "score": "7",
      "reason": "Good performance can lead to recognition within the company, especially if you improve production processes."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Manufacturing companies often provide training and support to help you succeed."
    },
    {
      "attribute": "Compensation",
      "score": "8",
      "reason": "Manufacturing Engineers in the automotive sector are generally well-paid, especially with experience."
    },
    {
      "attribute": "Security",
      "score": "8",
      "reason": "The automotive industry is stable, and skilled engineers are always in demand."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Technical Specialist",
      "description": "This pathway is great for those who love solving technical problems and working with advanced technology. To succeed, you need to keep learning about new tools and methods.",
      "jobRoles": [
        {
          "title": "Junior Manufacturing Engineer",
          "years": "0-2"
        },
        {
          "title": "Manufacturing Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior Manufacturing Engineer",
          "years": "5-8"
        },
        {
          "title": "Technical Specialist",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Project Manager",
      "description": "This pathway is ideal for those who enjoy planning and managing projects. Success comes from good communication and leadership skills.",
      "jobRoles": [
        {
          "title": "Junior Manufacturing Engineer",
          "years": "0-2"
        },
        {
          "title": "Manufacturing Engineer",
          "years": "2-4"
        },
        {
          "title": "Project Engineer",
          "years": "4-7"
        },
        {
          "title": "Project Manager",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Quality Assurance Manager",
      "description": "This pathway suits those who are detail-oriented and passionate about maintaining high standards. Success requires a strong focus on quality and continuous improvement.",
      "jobRoles": [
        {
          "title": "Junior Manufacturing Engineer",
          "years": "0-2"
        },
        {
          "title": "Quality Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior Quality Engineer",
          "years": "5-8"
        },
        {
          "title": "Quality Assurance Manager",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Operations Manager",
      "description": "This pathway is perfect for those who like overseeing production and improving processes. Success comes from strong organizational skills and a focus on efficiency.",
      "jobRoles": [
        {
          "title": "Junior Manufacturing Engineer",
          "years": "0-2"
        },
        {
          "title": "Manufacturing Engineer",
          "years": "2-4"
        },
        {
          "title": "Production Supervisor",
          "years": "4-7"
        },
        {
          "title": "Operations Manager",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Research and Development Manager",
      "description": "This pathway is great for those who love innovation and creating new products. Success requires creativity and a strong understanding of engineering principles.",
      "jobRoles": [
        {
          "title": "Junior Manufacturing Engineer",
          "years": "0-2"
        },
        {
          "title": "R&D Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior R&D Engineer",
          "years": "5-8"
        },
        {
          "title": "R&D Manager",
          "years": "8-10"
        }
      ]
    }
  ],
  "jobLocation": "India",
  "jobRole": "Manufacturing Engineer",
  "collegeCategory": "College",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Tata Motors",
        "description": "Tata Motors is one of the largest automobile manufacturers in India, producing a wide range of vehicles including cars, trucks, and buses.",
        "website": "https://www.tatamotors.com"
      },
      {
        "name": "Mahindra & Mahindra",
        "description": "Mahindra & Mahindra is a major player in the automotive industry, known for manufacturing SUVs, commercial vehicles, and two-wheelers.",
        "website": "https://www.mahindra.com"
      },
      {
        "name": "Maruti Suzuki",
        "description": "Maruti Suzuki is the largest car manufacturer in India, offering a variety of cars from small hatchbacks to sedans.",
        "website": "https://www.marutisuzuki.com"
      },
      {
        "name": "Ashok Leyland",
        "description": "Ashok Leyland is a leading manufacturer of commercial vehicles, including trucks and buses, in India.",
        "website": "https://www.ashokleyland.com"
      },
      {
        "name": "Hero MotoCorp",
        "description": "Hero MotoCorp is the world's largest manufacturer of two-wheelers, producing motorcycles and scooters.",
        "website": "https://www.heromotocorp.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities like Mumbai, Delhi, and Bangalore, employers are usually big automotive companies with large manufacturing plants. These companies often have advanced technology and large teams."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often mid-sized companies. They may have smaller plants but still produce a variety of vehicles. These companies may focus on specific types of vehicles or parts."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually smaller workshops or local manufacturing units. They may focus on assembling parts or producing specific vehicle components. These employers may have fewer resources and smaller teams."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹30,000 - ₹50,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹25,000 - ₹40,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹20,000 - ₹30,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_automotive_vehicle_manufacturing_entry_level_college_manufacturing_engineer",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66a0cb538a797a4096921859"
  },
  "sector": "Healthcare",
  "subSector": "Nursing and Patient Care",
  "createdAt": [
    {
      "$date": "2024-07-24T09:37:23.498Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:50.308Z"
  },
  "deleted": false,
  "jobLocation": "India",
  "jobRole": "EKG Technician",
  "jobProfile": {
    "generalDescription": {
      "text": "An EKG Technician helps doctors by recording the electrical activity of the heart. They use special machines to do this. They work in hospitals, clinics, and sometimes in doctors' offices. They help diagnose heart problems. They also explain the procedure to patients.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/EKG%20Technician-1722435941142.png",
      "mediaURLs": {
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/EKG%20Technician_Female-1722592709757.png",
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/EKG%20Technician_Male-1722592720740.png"
      }
    },
    "dayInTheLife": {
      "text": "An EKG Technician starts the day by checking the EKG machine to make sure it works well. They greet patients and explain the EKG test. They place electrodes on the patient's chest, arms, and legs. They then record the heart's activity. After the test, they clean the equipment and prepare for the next patient. They may also help with other tasks in the clinic or hospital."
    },
    "reasonsLiked": [
      {
        "reason": "You get to help people and make a difference in their health."
      },
      {
        "reason": "The job does not require a college degree."
      },
      {
        "reason": "You can work in different healthcare settings."
      },
      {
        "reason": "There is a steady demand for healthcare workers."
      },
      {
        "reason": "You can learn on the job and gain experience."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The job can be physically demanding."
      },
      {
        "reason": "You may have to work long hours or shifts."
      },
      {
        "reason": "It can be stressful dealing with sick patients."
      },
      {
        "reason": "You need to be very precise and careful."
      },
      {
        "reason": "The pay may not be very high at the start."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "To become an EKG Technician, students usually need to complete their 12th grade. In large cities, students often complete 12th grade with a focus on science subjects. In medium and small cities, towns, and villages, completing 12th grade in any stream is usually enough.",
      "trainingNeeded": "Students need to complete a certificate or diploma program in EKG technology. These programs are available in large cities and some medium cities. In small cities, towns, and villages, students might need to travel to larger cities for this training. These programs usually last from 6 months to 1 year.",
      "priorWorkExperience": "No prior work experience is usually needed to become an EKG Technician. However, some students might do internships or volunteer work in hospitals or clinics to gain some experience."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "7",
      "reason": "EKG Technicians need to analyze heart readings and identify abnormalities."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "6",
      "reason": "They must explain procedures to patients and communicate with healthcare staff."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "5",
      "reason": "Basic math skills are needed to measure and record heart activity."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "3",
      "reason": "The job follows standard procedures with little room for creative thinking."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "4",
      "reason": "Some spatial awareness is needed to place electrodes correctly on the body."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "8",
      "reason": "Good interpersonal skills are important for comforting patients and working with a team."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "7",
      "reason": "They must operate and troubleshoot EKG machines effectively."
    },
    {
      "attribute": "Organizational Skills",
      "score": "6",
      "reason": "Keeping patient records organized is an important part of the job."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "2",
      "reason": "This role does not typically involve business or entrepreneurial tasks."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "5",
      "reason": "Some physical effort is required to assist patients and handle equipment."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Specialized EKG Technician",
      "description": "This pathway is good for those who enjoy working with advanced medical equipment. Success comes from gaining specialized certifications and experience.",
      "jobRoles": [
        {
          "title": "Junior EKG Technician",
          "years": "0-2"
        },
        {
          "title": "Senior EKG Technician",
          "years": "2-5"
        },
        {
          "title": "Lead EKG Technician",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Healthcare Administration",
      "description": "This pathway is ideal for those who want to move into management roles. Success comes from learning about healthcare management and gaining leadership skills.",
      "jobRoles": [
        {
          "title": "Junior EKG Technician",
          "years": "0-2"
        },
        {
          "title": "Healthcare Coordinator",
          "years": "2-5"
        },
        {
          "title": "Healthcare Manager",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Patient Care Specialist",
      "description": "This pathway suits those who love direct patient interaction. Success comes from gaining experience in patient care and completing additional training.",
      "jobRoles": [
        {
          "title": "Junior EKG Technician",
          "years": "0-2"
        },
        {
          "title": "Patient Care Technician",
          "years": "2-5"
        },
        {
          "title": "Senior Patient Care Specialist",
          "years": "5-10"
        }
      ]
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "8",
      "reason": "This job involves working with medical equipment and performing hands-on tasks."
    },
    {
      "attribute": "Investigative",
      "score": "6",
      "reason": "This job requires understanding how to read and interpret EKG results, which involves some investigative skills."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job does not involve creativity or artistic skills."
    },
    {
      "attribute": "Social",
      "score": "7",
      "reason": "This job involves interacting with patients and healthcare staff, requiring good communication skills."
    },
    {
      "attribute": "Enterprising",
      "score": "3",
      "reason": "This job does not involve much leadership or business skills."
    },
    {
      "attribute": "Conventional",
      "score": "9",
      "reason": "This job follows set procedures and routines, which suits people who like structured tasks."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "7",
      "reason": "EKG Technicians often work regular hours, but may need to work nights or weekends."
    },
    {
      "attribute": "Achievement",
      "score": "6",
      "reason": "This job allows you to help patients and be part of a healthcare team, but it may not offer much room for advancement."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "EKG Technicians usually work under the supervision of doctors and nurses, so there is limited independence."
    },
    {
      "attribute": "Recognition",
      "score": "4",
      "reason": "This role is important but often does not receive much public recognition."
    },
    {
      "attribute": "Supportive Environment",
      "score": "8",
      "reason": "Healthcare settings usually have a supportive team environment."
    },
    {
      "attribute": "Compensation",
      "score": "5",
      "reason": "The pay is moderate and can vary depending on the location and employer."
    },
    {
      "attribute": "Security",
      "score": "9",
      "reason": "Healthcare jobs are generally stable and in demand, providing good job security."
    }
  ],
  "collegeCategory": "Non-College",
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Apollo Hospitals",
        "description": "A leading healthcare provider with hospitals across India.",
        "website": "https://www.apollohospitals.com/"
      },
      {
        "name": "Fortis Healthcare",
        "description": "A major chain of hospitals offering a range of medical services.",
        "website": "https://www.fortishealthcare.com/"
      },
      {
        "name": "Max Healthcare",
        "description": "A network of hospitals providing high-quality healthcare services.",
        "website": "https://www.maxhealthcare.in/"
      },
      {
        "name": "Manipal Hospitals",
        "description": "One of India's largest healthcare networks.",
        "website": "https://www.manipalhospitals.com/"
      },
      {
        "name": "Narayana Health",
        "description": "A healthcare group known for affordable and quality healthcare.",
        "website": "https://www.narayanahealth.org/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually big hospitals and healthcare chains. They have advanced medical equipment and offer specialized services. They also provide good training and career growth opportunities."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often smaller hospitals and clinics. They may not have as much advanced equipment as big city hospitals, but they still provide essential healthcare services. These employers may offer a more personal work environment."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually local clinics and health centers. They focus on basic healthcare services and may have limited resources. Working here can be rewarding as you help improve healthcare in underserved areas."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹18,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹8,000 - ₹12,000"
    }
  ],
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "jobRoleKey": "india_healthcare_nursing_and_patient_care_entry_level_non_college_ekg_technician",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66a9c999d0aea125c6555651"
  },
  "collegeCategory": "College",
  "jobProfile": {
    "generalDescription": {
      "text": "A Software Engineer writes and tests code for computer programs. They work on creating software applications and systems. They solve problems and fix bugs in the software. They also work with other team members to design new features. Their goal is to make sure the software runs smoothly.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Software%20Engineer-1722436598883.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Software%20Engineer-1722957656500.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Software%20Engineer-1722957686710.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for a Software Engineer starts with a team meeting to discuss tasks. They spend most of their day writing and testing code. They also review code written by other team members. They may have meetings with other departments to understand project requirements. At the end of the day, they update their progress and plan for the next day."
    },
    "reasonsLiked": [
      {
        "reason": "High salary and good job security."
      },
      {
        "reason": "Opportunities to work on interesting and challenging projects."
      },
      {
        "reason": "Chance to learn new technologies and skills."
      },
      {
        "reason": "Flexible work hours and the possibility to work from home."
      },
      {
        "reason": "Being part of a team and collaborating with others."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Long hours and tight deadlines can be stressful."
      },
      {
        "reason": "Sitting for long periods can be tiring."
      },
      {
        "reason": "Constant need to update skills and learn new technologies."
      },
      {
        "reason": "Dealing with bugs and errors can be frustrating."
      },
      {
        "reason": "Sometimes work can be repetitive and monotonous."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Students typically need a degree in Computer Science, Information Technology, or Software Engineering.",
      "trainingNeeded": "Additional training in programming languages like Java, Python, or C++ is helpful. Certifications in software development or specific technologies can also be beneficial. In large cities, students may have access to more advanced training programs.",
      "priorWorkExperience": "Internships or part-time jobs in software development are valuable. In large cities, students may find more opportunities for internships. In smaller cities and towns, students might gain experience through online projects or freelancing."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "9",
      "reason": "Software engineers need to solve complex problems and think logically."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "7",
      "reason": "They must communicate with team members and sometimes clients."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "8",
      "reason": "Understanding algorithms and data structures requires good numerical skills."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "7",
      "reason": "Creating new software solutions often requires innovative thinking."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "4",
      "reason": "This skill is less important for software development."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "6",
      "reason": "Working in teams requires good interpersonal skills."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "10",
      "reason": "Strong technical skills are essential for writing and debugging code."
    },
    {
      "attribute": "Organizational Skills",
      "score": "7",
      "reason": "Managing projects and meeting deadlines require good organizational skills."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "5",
      "reason": "These skills are useful but not essential for entry-level positions."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "2",
      "reason": "This job is mostly desk-based and does not require physical skills."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "6",
      "reason": "Software Engineers work with real-world problems and create practical solutions, but the job is mostly desk-based."
    },
    {
      "attribute": "Investigative",
      "score": "9",
      "reason": "This job involves a lot of problem-solving, research, and logical thinking."
    },
    {
      "attribute": "Artistic",
      "score": "4",
      "reason": "There is some creativity in coding and designing software, but it is not the main focus."
    },
    {
      "attribute": "Social",
      "score": "5",
      "reason": "Software Engineers often work in teams, but much of the work is done individually."
    },
    {
      "attribute": "Enterprising",
      "score": "7",
      "reason": "There are opportunities to lead projects and innovate, but it is not the primary focus."
    },
    {
      "attribute": "Conventional",
      "score": "8",
      "reason": "This job follows structured methods and processes, and there are clear guidelines and standards to follow."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "6",
      "reason": "Software Engineers often work long hours, but many companies offer flexible schedules."
    },
    {
      "attribute": "Achievement",
      "score": "9",
      "reason": "This job allows you to solve complex problems and see the results of your work."
    },
    {
      "attribute": "Independence",
      "score": "7",
      "reason": "You can work on projects independently, but you will also need to collaborate with a team."
    },
    {
      "attribute": "Recognition",
      "score": "8",
      "reason": "Good performance can lead to promotions and awards within the company."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Many companies provide training and mentorship, but the environment can be competitive."
    },
    {
      "attribute": "Compensation",
      "score": "8",
      "reason": "Software Engineers are generally well-paid, especially with experience."
    },
    {
      "attribute": "Security",
      "score": "9",
      "reason": "The demand for Software Engineers is high, making job security strong in this field."
    }
  ],
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹40,000 - ₹1,00,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹25,000 - ₹60,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹15,000 - ₹30,000"
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Technical Specialist",
      "description": "This pathway is great for those who love coding and solving technical problems. To succeed, focus on learning new programming languages and tools.",
      "jobRoles": [
        {
          "title": "Junior Software Engineer",
          "years": "0-2"
        },
        {
          "title": "Software Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior Software Engineer",
          "years": "5-8"
        },
        {
          "title": "Technical Lead",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Project Management",
      "description": "This pathway is ideal for those who enjoy planning and managing projects. To succeed, develop strong leadership and communication skills.",
      "jobRoles": [
        {
          "title": "Junior Software Engineer",
          "years": "0-2"
        },
        {
          "title": "Software Engineer",
          "years": "2-4"
        },
        {
          "title": "Project Coordinator",
          "years": "4-6"
        },
        {
          "title": "Project Manager",
          "years": "6-10"
        }
      ]
    },
    {
      "pathwayTitle": "Product Management",
      "description": "This pathway suits those who are interested in both technology and business. To succeed, understand market needs and work closely with development teams.",
      "jobRoles": [
        {
          "title": "Junior Software Engineer",
          "years": "0-2"
        },
        {
          "title": "Software Engineer",
          "years": "2-4"
        },
        {
          "title": "Product Analyst",
          "years": "4-6"
        },
        {
          "title": "Product Manager",
          "years": "6-10"
        }
      ]
    },
    {
      "pathwayTitle": "Quality Assurance",
      "description": "This pathway is for those who have a keen eye for detail and enjoy testing software. To succeed, learn various testing tools and methodologies.",
      "jobRoles": [
        {
          "title": "Junior Software Engineer",
          "years": "0-2"
        },
        {
          "title": "Software Engineer",
          "years": "2-4"
        },
        {
          "title": "QA Engineer",
          "years": "4-6"
        },
        {
          "title": "QA Lead",
          "years": "6-10"
        }
      ]
    },
    {
      "pathwayTitle": "DevOps Engineering",
      "description": "This pathway is perfect for those who like both development and operations. To succeed, gain skills in automation, cloud services, and continuous integration.",
      "jobRoles": [
        {
          "title": "Junior Software Engineer",
          "years": "0-2"
        },
        {
          "title": "Software Engineer",
          "years": "2-4"
        },
        {
          "title": "DevOps Engineer",
          "years": "4-6"
        },
        {
          "title": "Senior DevOps Engineer",
          "years": "6-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Tata Consultancy Services (TCS)",
        "description": "TCS is a global IT services, consulting, and business solutions organization.",
        "website": "https://www.tcs.com"
      },
      {
        "name": "Infosys",
        "description": "Infosys is a global leader in next-generation digital services and consulting.",
        "website": "https://www.infosys.com"
      },
      {
        "name": "Wipro",
        "description": "Wipro is a leading global information technology, consulting, and business process services company.",
        "website": "https://www.wipro.com"
      },
      {
        "name": "HCL Technologies",
        "description": "HCL Technologies is a next-generation global technology company that helps enterprises reimagine their businesses.",
        "website": "https://www.hcltech.com"
      },
      {
        "name": "Tech Mahindra",
        "description": "Tech Mahindra offers innovative and customer-centric information technology services and solutions.",
        "website": "https://www.techmahindra.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities like Bangalore, Mumbai, and Delhi, employers are usually big IT companies, multinational corporations, and tech startups. These companies often have large offices and many employees. They work on big projects for clients all over the world."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often mid-sized IT companies and local tech firms. These companies may not be as big as those in large cities, but they still work on important projects. They often focus on local or regional clients."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, there are fewer IT companies. Employers are usually small tech firms or local businesses that need IT support. These companies may have fewer employees and work on smaller projects. They often serve local clients."
      }
    ]
  },
  "jobRole": "Software Engineer",
  "jobLocation": "India",
  "sector": "IT / ITeS (Information Technology / Information Technology enabled Services)",
  "subSector": "Software Development",
  "generatedBy": "OpenAI GPT-4o",
  "createdAt": [
    {
      "$date": "2024-07-31T10:50:25.150Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:55.268Z"
  },
  "deleted": false,
  "languageCode": "en",
  "jobRoleKey": "india_it_ites_information_technology_information_technology_enabled_services_software_development_entry_level_college_software_engineer",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66a9cc2370e1b49c474d74ae"
  },
  "collegeCategory": "College",
  "jobProfile": {
    "generalDescription": {
      "text": "A Military Officer in India leads and manages soldiers. They plan missions, train troops, and ensure safety. They also handle administrative tasks and make strategic decisions. Their role is crucial for national security.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Military%20Officer-1722425759443.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Military%20Officer-1722957876479.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Military%20Officer-1722957904570.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for a Military Officer starts early with physical training. They then attend briefings and plan missions. Throughout the day, they train soldiers, inspect equipment, and ensure readiness. They also handle paperwork and communicate with higher command. Evenings might involve more training or strategy meetings."
    },
    "reasonsLiked": [
      {
        "reason": "Serving the country and contributing to national security."
      },
      {
        "reason": "Opportunities for leadership and responsibility."
      },
      {
        "reason": "Good salary and benefits."
      },
      {
        "reason": "Job stability and respect in society."
      },
      {
        "reason": "Travel and adventure."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Long and irregular working hours."
      },
      {
        "reason": "Frequent relocations and time away from family."
      },
      {
        "reason": "High physical and mental stress."
      },
      {
        "reason": "Risk of injury or death."
      },
      {
        "reason": "Strict discipline and hierarchy."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Students typically need a bachelor's degree. Common fields of study include engineering, science, and arts.",
      "trainingNeeded": "Candidates must complete training at the National Defence Academy (NDA) or Indian Military Academy (IMA). Training includes physical fitness, military tactics, and leadership skills. This is consistent across large cities, medium & small cities, and towns & villages.",
      "priorWorkExperience": "No prior work experience is needed, but participation in NCC (National Cadet Corps) can be helpful. This is true across all geographic areas."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "8",
      "reason": "Military officers need to make quick and effective decisions in complex situations."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "9",
      "reason": "Clear communication is essential for giving orders and coordinating with team members."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "6",
      "reason": "Basic numerical skills are needed for tasks like logistics and resource management."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "5",
      "reason": "While some creativity is useful, military roles often follow established protocols."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "8",
      "reason": "Understanding terrain and spatial relationships is crucial for planning and executing missions."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "7",
      "reason": "Building strong relationships with team members and other units is important."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "7",
      "reason": "Familiarity with military technology and equipment is necessary."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "Military officers must manage resources and personnel effectively."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "4",
      "reason": "This role follows a structured environment with less focus on entrepreneurial activities."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "10",
      "reason": "High physical fitness and manual skills are critical for the demands of military duties."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "9",
      "reason": "Military Officers work in real-world settings and often handle physical tasks and equipment."
    },
    {
      "attribute": "Investigative",
      "score": "7",
      "reason": "Military Officers need to analyze situations and make strategic decisions."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job does not involve much creative or artistic work."
    },
    {
      "attribute": "Social",
      "score": "8",
      "reason": "Military Officers work closely with others and lead teams."
    },
    {
      "attribute": "Enterprising",
      "score": "9",
      "reason": "This job involves leadership, decision-making, and taking initiative."
    },
    {
      "attribute": "Conventional",
      "score": "6",
      "reason": "Military Officers follow strict rules and procedures, but also need to adapt to changing situations."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "4",
      "reason": "Military officers often have long hours and may be deployed away from home for extended periods."
    },
    {
      "attribute": "Achievement",
      "score": "9",
      "reason": "Military officers have the opportunity to achieve significant goals and contribute to national security."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "While there is some independence, military officers must follow strict orders and protocols."
    },
    {
      "attribute": "Recognition",
      "score": "8",
      "reason": "Military officers receive recognition through ranks, medals, and honors for their service."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "The military provides a strong support system, including training and camaraderie among peers."
    },
    {
      "attribute": "Compensation",
      "score": "6",
      "reason": "Military officers receive a decent salary and benefits, but it may not be as high as some private sector jobs."
    },
    {
      "attribute": "Security",
      "score": "10",
      "reason": "Military officers have high job security and benefits, including pensions and healthcare."
    }
  ],
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹56,100 - ₹1,77,500"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹56,100 - ₹1,77,500"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹56,100 - ₹1,77,500"
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Combat Specialist",
      "description": "This pathway is for those who are brave and physically fit. It is attractive for those who want to serve on the front lines and protect the country.",
      "jobRoles": [
        {
          "title": "Lieutenant",
          "years": "0-2"
        },
        {
          "title": "Captain",
          "years": "2-5"
        },
        {
          "title": "Major",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Technical Officer",
      "description": "This pathway is for those who are good with technology and engineering. It is attractive for those who want to work with advanced military equipment and systems.",
      "jobRoles": [
        {
          "title": "Lieutenant",
          "years": "0-2"
        },
        {
          "title": "Captain",
          "years": "2-5"
        },
        {
          "title": "Major",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Administrative Officer",
      "description": "This pathway is for those who are good at managing people and resources. It is attractive for those who want to handle the administrative tasks of the military.",
      "jobRoles": [
        {
          "title": "Lieutenant",
          "years": "0-2"
        },
        {
          "title": "Captain",
          "years": "2-5"
        },
        {
          "title": "Major",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Intelligence Officer",
      "description": "This pathway is for those who are good at gathering and analyzing information. It is attractive for those who want to work in military intelligence and security.",
      "jobRoles": [
        {
          "title": "Lieutenant",
          "years": "0-2"
        },
        {
          "title": "Captain",
          "years": "2-5"
        },
        {
          "title": "Major",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Medical Officer",
      "description": "This pathway is for those who are trained in medicine and want to help soldiers. It is attractive for those who want to provide medical care in the military.",
      "jobRoles": [
        {
          "title": "Lieutenant",
          "years": "0-2"
        },
        {
          "title": "Captain",
          "years": "2-5"
        },
        {
          "title": "Major",
          "years": "5-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Indian Army",
        "description": "The land-based branch of the Indian Armed Forces.",
        "website": "https://www.indianarmy.nic.in/"
      },
      {
        "name": "Indian Navy",
        "description": "The naval branch of the Indian Armed Forces.",
        "website": "https://www.indiannavy.nic.in/"
      },
      {
        "name": "Indian Air Force",
        "description": "The air arm of the Indian Armed Forces.",
        "website": "https://indianairforce.nic.in/"
      },
      {
        "name": "Indian Coast Guard",
        "description": "A maritime law enforcement and search and rescue agency.",
        "website": "https://www.indiancoastguard.gov.in/"
      },
      {
        "name": "Border Security Force (BSF)",
        "description": "A paramilitary force charged with guarding India's land borders.",
        "website": "https://bsf.gov.in/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually the main offices of the Indian Armed Forces. These offices handle administration, training, and planning."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often regional command centers. These centers manage local operations and support."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are typically smaller military bases. These bases focus on local security and training."
      }
    ]
  },
  "jobRole": "Military Officer",
  "jobLocation": "India",
  "sector": "Public Administration and Defence",
  "subSector": "Military",
  "generatedBy": "OpenAI GPT-4o",
  "createdAt": [
    {
      "$date": "2024-07-31T11:01:15.108Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:53.172Z"
  },
  "deleted": false,
  "languageCode": "en",
  "jobRoleKey": "india_public_administration_and_defence_military_entry_level_college_military_officer",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66a9e56c5bde2fc3fd1bfcaa"
  },
  "collegeCategory": "College",
  "jobProfile": {
    "generalDescription": {
      "text": "A Civil Engineer in Construction Management plans, designs, and oversees construction projects. They ensure projects are completed on time and within budget. They work with architects, contractors, and other engineers. They also make sure that structures are safe and meet legal standards. This role often involves site visits and managing teams.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Civil%20Engineer-1722425485562.png",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Civil%20Engineer-1722958106146.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Civil%20Engineer-1722958140783.png"
      }
    },
    "dayInTheLife": {
      "text": "A typical day for a Civil Engineer in Construction Management starts with reviewing project plans and schedules. They visit construction sites to check progress and ensure safety standards are met. They meet with contractors and architects to discuss project details. They also handle paperwork, such as permits and reports. By the end of the day, they update project timelines and budgets."
    },
    "reasonsLiked": [
      {
        "reason": "Opportunity to work on large and impactful projects."
      },
      {
        "reason": "Variety in daily tasks and responsibilities."
      },
      {
        "reason": "Good salary and job stability."
      },
      {
        "reason": "Chance to work outdoors and on-site."
      },
      {
        "reason": "Ability to see tangible results of your work."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Long and irregular working hours."
      },
      {
        "reason": "High levels of stress and responsibility."
      },
      {
        "reason": "Frequent travel to construction sites."
      },
      {
        "reason": "Exposure to harsh weather conditions."
      },
      {
        "reason": "Need to handle conflicts and problems on-site."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Students typically need a Bachelor's degree in Civil Engineering. Some may also pursue a Master's degree for advanced knowledge.",
      "trainingNeeded": "Additional training in project management and construction safety is helpful. In large cities, students might also take courses in advanced software tools used in construction.",
      "priorWorkExperience": "Internships or part-time jobs in construction companies are common. In large cities, students might work on bigger projects, while in smaller towns, they might gain experience in local construction firms."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "9",
      "reason": "Civil engineers need to solve complex problems and make decisions based on data and analysis."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "7",
      "reason": "Civil engineers must communicate with clients, workers, and other engineers effectively."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "8",
      "reason": "Civil engineers use math to design and analyze structures and materials."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "6",
      "reason": "While civil engineering follows set principles, innovative solutions are often needed for unique problems."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "8",
      "reason": "Civil engineers must understand how different parts of a project fit together in physical space."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "7",
      "reason": "Civil engineers often work in teams and need to manage relationships with various stakeholders."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "9",
      "reason": "Civil engineers must be skilled in using technical tools and understanding engineering principles."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "Civil engineers must manage projects, timelines, and resources efficiently."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "5",
      "reason": "While not essential, entrepreneurial skills can help civil engineers who want to start their own firms."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "6",
      "reason": "Civil engineers may need to visit construction sites and understand physical work, but the job is not highly physical."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "9",
      "reason": "Civil Engineers work on real-world projects like buildings, roads, and bridges. They use practical skills and tools."
    },
    {
      "attribute": "Investigative",
      "score": "7",
      "reason": "Civil Engineers need to solve problems and use math and science to design structures. They often investigate materials and methods."
    },
    {
      "attribute": "Artistic",
      "score": "4",
      "reason": "While there is some creativity in designing structures, the job is more focused on functionality and safety than artistic expression."
    },
    {
      "attribute": "Social",
      "score": "6",
      "reason": "Civil Engineers often work in teams and must communicate with clients, workers, and other engineers. However, the job is not primarily social."
    },
    {
      "attribute": "Enterprising",
      "score": "5",
      "reason": "There are opportunities to lead projects and make decisions, but the job is more technical than business-oriented."
    },
    {
      "attribute": "Conventional",
      "score": "8",
      "reason": "Civil Engineers follow established procedures and standards. They work in a structured environment with clear rules and guidelines."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "5",
      "reason": "Civil engineers often work long hours, especially when project deadlines are near. However, some companies offer flexible schedules."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "Civil engineers can see the tangible results of their work, such as buildings and infrastructure, which can be very satisfying."
    },
    {
      "attribute": "Independence",
      "score": "6",
      "reason": "While civil engineers have some independence in their work, they often need to collaborate with other professionals and follow project guidelines."
    },
    {
      "attribute": "Recognition",
      "score": "7",
      "reason": "Successful projects can bring recognition from peers and clients, but it may take time to build a reputation."
    },
    {
      "attribute": "Supportive Environment",
      "score": "6",
      "reason": "The work environment can vary. Some companies offer strong support systems, while others may be more challenging."
    },
    {
      "attribute": "Compensation",
      "score": "7",
      "reason": "Civil engineers in India earn a decent salary, especially with experience and advanced degrees."
    },
    {
      "attribute": "Security",
      "score": "8",
      "reason": "There is a steady demand for civil engineers in India, providing good job security, especially in urban areas."
    }
  ],
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹30,000 - ₹60,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹25,000 - ₹50,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹20,000 - ₹40,000"
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Project Management Pathway",
      "description": "This pathway is great for those who enjoy planning and leading projects. It attracts organized and detail-oriented people who can manage time and resources well.",
      "jobRoles": [
        {
          "title": "Junior Civil Engineer",
          "years": "0-2"
        },
        {
          "title": "Assistant Project Manager",
          "years": "2-5"
        },
        {
          "title": "Project Manager",
          "years": "5-8"
        },
        {
          "title": "Senior Project Manager",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Structural Engineering Pathway",
      "description": "This pathway is ideal for those who love designing and analyzing structures. It attracts creative and analytical thinkers who can solve complex problems.",
      "jobRoles": [
        {
          "title": "Junior Structural Engineer",
          "years": "0-2"
        },
        {
          "title": "Structural Engineer",
          "years": "2-5"
        },
        {
          "title": "Senior Structural Engineer",
          "years": "5-8"
        },
        {
          "title": "Lead Structural Engineer",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Construction Management Pathway",
      "description": "This pathway is perfect for those who like overseeing construction projects from start to finish. It attracts leaders who can handle multiple tasks and work well with different teams.",
      "jobRoles": [
        {
          "title": "Site Engineer",
          "years": "0-2"
        },
        {
          "title": "Construction Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Construction Manager",
          "years": "5-8"
        },
        {
          "title": "Director of Construction",
          "years": "8-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Larsen & Toubro",
        "description": "A major technology, engineering, construction, manufacturing, and financial services conglomerate.",
        "website": "https://www.larsentoubro.com/"
      },
      {
        "name": "Tata Projects",
        "description": "A leading infrastructure development company.",
        "website": "https://www.tataprojects.com/"
      },
      {
        "name": "Shapoorji Pallonji",
        "description": "A large construction, infrastructure, and real estate company.",
        "website": "https://www.shapoorjipallonji.com/"
      },
      {
        "name": "Hindustan Construction Company",
        "description": "A major player in engineering and construction.",
        "website": "https://www.hccindia.com/"
      },
      {
        "name": "Gammon India",
        "description": "One of the largest civil engineering construction companies in India.",
        "website": "http://www.gammonindia.com/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are often big construction firms, real estate developers, and government agencies. These employers handle large-scale projects like skyscrapers, bridges, and highways."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers include regional construction companies, local government bodies, and smaller real estate developers. Projects here may include residential buildings, commercial complexes, and local infrastructure."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually local contractors, small construction firms, and municipal bodies. Projects often focus on basic infrastructure like roads, schools, and community buildings."
      }
    ]
  },
  "jobRole": "Civil Engineer",
  "jobLocation": "India",
  "sector": "Construction and Real Estate",
  "subSector": "Construction Management",
  "generatedBy": "OpenAI GPT-4o",
  "createdAt": [
    {
      "$date": "2024-07-31T12:49:08.871Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:49.072Z"
  },
  "deleted": false,
  "languageCode": "en",
  "jobRoleKey": "india_construction_and_real_estate_construction_management_entry_level_college_civil_engineer",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66aa4ecf65480c1bedb5283b"
  },
  "collegeCategory": "College",
  "jobProfile": {
    "generalDescription": {
      "text": "A Financial Analyst in the BFSI sector helps banks make smart financial decisions. They study market trends, analyze financial data, and create reports. They also help in budgeting and forecasting. Their work supports the bank's financial health. They often work with other departments to gather information.",
      "mediaURL": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Financial%20Analyst-1722437247732.png"
    },
    "dayInTheLife": {
      "text": "A typical day for a Financial Analyst starts with checking emails and market news. They spend a lot of time analyzing financial data and creating reports. They attend meetings to discuss their findings with other teams. They also work on financial models and forecasts. At the end of the day, they might review their work and plan for the next day."
    },
    "reasonsLiked": [
      {
        "reason": "The job offers good pay and benefits."
      },
      {
        "reason": "It provides opportunities to learn about finance and markets."
      },
      {
        "reason": "The work is challenging and keeps you engaged."
      },
      {
        "reason": "There are clear paths for career growth."
      },
      {
        "reason": "You get to work with smart and motivated people."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The job can be very stressful, especially during financial reporting periods."
      },
      {
        "reason": "Long working hours are common."
      },
      {
        "reason": "The work can sometimes be repetitive."
      },
      {
        "reason": "There is a lot of pressure to meet deadlines."
      },
      {
        "reason": "You might have to deal with a lot of data, which can be overwhelming."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Most Financial Analysts have a degree in finance, accounting, economics, or business administration.",
      "trainingNeeded": "In large cities, students often take extra courses in financial modeling and analysis. In medium and small cities, students might attend workshops or online courses. In towns and villages, students might rely more on self-study and online resources.",
      "priorWorkExperience": "Internships in banks or financial institutions are very helpful. In large cities, students might have more opportunities for internships. In medium and small cities, students might work part-time in local banks. In towns and villages, students might gain experience through family businesses or local financial firms."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "9",
      "reason": "Financial Analysts need to analyze data and make logical decisions based on their findings."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "7",
      "reason": "They must communicate their findings and recommendations clearly to clients and colleagues."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "10",
      "reason": "A strong understanding of numbers and financial data is crucial for this role."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "5",
      "reason": "While not the main focus, some creative problem-solving can be beneficial."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "3",
      "reason": "This job does not require much spatial awareness."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "6",
      "reason": "Working with clients and team members requires good interpersonal skills."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "8",
      "reason": "Proficiency with financial software and tools is important."
    },
    {
      "attribute": "Organizational Skills",
      "score": "7",
      "reason": "Keeping track of data and reports requires good organizational skills."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "4",
      "reason": "This role is more about analysis than starting or running a business."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "2",
      "reason": "The job is desk-based and does not require physical or manual skills."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "4",
      "reason": "The job involves working with data and financial reports, but not much hands-on work or outdoor activities."
    },
    {
      "attribute": "Investigative",
      "score": "8",
      "reason": "The job requires analyzing financial data, researching market trends, and solving complex problems."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "The job has little to do with creativity or artistic expression."
    },
    {
      "attribute": "Social",
      "score": "5",
      "reason": "The job involves some interaction with colleagues and clients, but it is not primarily focused on social activities."
    },
    {
      "attribute": "Enterprising",
      "score": "7",
      "reason": "The job involves making decisions, taking initiative, and sometimes leading projects or teams."
    },
    {
      "attribute": "Conventional",
      "score": "9",
      "reason": "The job involves following set procedures, working with numbers, and adhering to financial regulations."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "6",
      "reason": "Financial Analysts often work long hours, especially during busy periods, but some companies offer flexible schedules."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "This job allows you to see the results of your work through financial reports and company performance."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "While there is some independence, Financial Analysts often work in teams and follow guidelines."
    },
    {
      "attribute": "Recognition",
      "score": "7",
      "reason": "Good performance can lead to recognition and promotions within the company."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Many banks and financial institutions offer training and support for their employees."
    },
    {
      "attribute": "Compensation",
      "score": "8",
      "reason": "Financial Analysts are generally well-paid, especially in large cities and top firms."
    },
    {
      "attribute": "Security",
      "score": "9",
      "reason": "The BFSI sector is stable, and there is a constant demand for skilled Financial Analysts."
    }
  ],
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹30,000 - ₹60,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹20,000 - ₹40,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹15,000 - ₹25,000"
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Corporate Banking Specialist",
      "description": "This pathway is attractive for those who enjoy working with large companies and handling big financial deals. Success in this pathway requires strong analytical skills and good relationship management.",
      "jobRoles": [
        {
          "title": "Financial Analyst",
          "years": "0-2"
        },
        {
          "title": "Senior Financial Analyst",
          "years": "2-5"
        },
        {
          "title": "Assistant Vice President - Corporate Banking",
          "years": "5-8"
        },
        {
          "title": "Vice President - Corporate Banking",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Investment Banking Professional",
      "description": "This pathway is ideal for those who are interested in mergers, acquisitions, and raising capital for companies. Success here requires excellent financial modeling skills and the ability to work under pressure.",
      "jobRoles": [
        {
          "title": "Financial Analyst",
          "years": "0-2"
        },
        {
          "title": "Associate - Investment Banking",
          "years": "2-4"
        },
        {
          "title": "Vice President - Investment Banking",
          "years": "4-7"
        },
        {
          "title": "Director - Investment Banking",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Risk Management Expert",
      "description": "This pathway suits those who are good at identifying and managing financial risks. Success in this pathway requires strong problem-solving skills and attention to detail.",
      "jobRoles": [
        {
          "title": "Financial Analyst",
          "years": "0-2"
        },
        {
          "title": "Risk Analyst",
          "years": "2-4"
        },
        {
          "title": "Risk Manager",
          "years": "4-7"
        },
        {
          "title": "Senior Risk Manager",
          "years": "7-10"
        }
      ]
    },
    {
      "pathwayTitle": "Retail Banking Leader",
      "description": "This pathway is great for those who enjoy working with individual customers and managing retail banking operations. Success here requires good customer service skills and the ability to manage a team.",
      "jobRoles": [
        {
          "title": "Financial Analyst",
          "years": "0-2"
        },
        {
          "title": "Branch Manager",
          "years": "2-5"
        },
        {
          "title": "Regional Manager - Retail Banking",
          "years": "5-8"
        },
        {
          "title": "Head of Retail Banking",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Financial Planning and Analysis (FP&A) Specialist",
      "description": "This pathway is perfect for those who like budgeting, forecasting, and analyzing financial performance. Success in this pathway requires strong analytical skills and proficiency in financial software.",
      "jobRoles": [
        {
          "title": "Financial Analyst",
          "years": "0-2"
        },
        {
          "title": "FP&A Analyst",
          "years": "2-4"
        },
        {
          "title": "FP&A Manager",
          "years": "4-7"
        },
        {
          "title": "Director of FP&A",
          "years": "7-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "HDFC Bank",
        "description": "One of India's leading private sector banks.",
        "website": "https://www.hdfcbank.com/"
      },
      {
        "name": "ICICI Bank",
        "description": "A major private sector bank in India.",
        "website": "https://www.icicibank.com/"
      },
      {
        "name": "State Bank of India (SBI)",
        "description": "The largest public sector bank in India.",
        "website": "https://www.sbi.co.in/"
      },
      {
        "name": "Axis Bank",
        "description": "A leading private sector bank in India.",
        "website": "https://www.axisbank.com/"
      },
      {
        "name": "Kotak Mahindra Bank",
        "description": "A prominent private sector bank in India.",
        "website": "https://www.kotak.com/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually big banks and financial institutions. They have many branches and offer many services. These employers often have large offices and many employees."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often regional banks and smaller financial firms. They may have fewer branches and employees but still offer many banking services."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually local branches of larger banks or cooperative banks. They have fewer employees and offer basic banking services."
      }
    ]
  },
  "jobRole": "Financial Analyst",
  "jobLocation": "India",
  "sector": "BFSI (Banking, Financial Services, and Insurance)",
  "subSector": "Banking Operations",
  "generatedBy": "OpenAI GPT-4o",
  "createdAt": [
    {
      "$date": "2024-07-31T20:18:47.321Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-16T15:10:51.488Z"
  },
  "deleted": false,
  "languageCode": "en",
  "jobRoleKey": "india_bfsi_banking_financial_services_and_insurance_banking_operations_entry_level_college_financial_analyst",
  "experienceLevel": "entry-level"
},
{
  "_id": {
    "$oid": "66bf2661b60fa0f06a623caf"
  },
  "collegeCategory": "College",
  "jobProfile": {
    "generalDescription": {
      "text": "An Executive Chef is the head chef in a restaurant or hotel. They plan menus, manage kitchen staff, and ensure food quality. They also oversee food preparation and presentation. Executive Chefs work closely with suppliers to get the best ingredients. They ensure the kitchen meets health and safety standards.",
      "mediaURLs": {
        "male": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Executive%20Chef-1723803185507.png",
        "female": "https://wofileservicedev1.blob.core.windows.net/career-advisor-images/Executive%20Chef-1723803209277.png"
      }
    },
    "dayInTheLife": {
      "text": "An Executive Chef starts the day by checking inventory and ordering supplies. They plan the day's menu and assign tasks to kitchen staff. Throughout the day, they supervise food preparation and ensure dishes are cooked perfectly. They also taste dishes to maintain quality. In the evening, they may meet with restaurant managers to discuss any issues and plan for the next day."
    },
    "reasonsLiked": [
      {
        "reason": "Creative freedom to design menus."
      },
      {
        "reason": "Opportunity to work with high-quality ingredients."
      },
      {
        "reason": "Leadership role in the kitchen."
      },
      {
        "reason": "Chance to make a name in the culinary world."
      },
      {
        "reason": "Satisfaction from customer appreciation."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Long and irregular working hours."
      },
      {
        "reason": "High-stress environment, especially during peak hours."
      },
      {
        "reason": "Physical demands of standing for long periods."
      },
      {
        "reason": "Pressure to maintain high standards consistently."
      },
      {
        "reason": "Managing a large team can be challenging."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Most Executive Chefs have a degree in Culinary Arts or Hotel Management.",
      "trainingNeeded": "Additional training includes internships or apprenticeships in professional kitchens. In large cities, specialized culinary schools offer advanced courses. In medium and small cities, local culinary institutes provide training. In towns and villages, hands-on experience in local restaurants is common.",
      "priorWorkExperience": "Typically, aspiring Executive Chefs start as line cooks or sous chefs. They gain experience in various kitchen roles. In large cities, working in high-end restaurants is common. In medium and small cities, experience in well-known local restaurants is valuable. In towns and villages, working in family-owned or local eateries provides good experience."
    }
  },
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "7",
      "reason": "An Executive Chef needs to plan menus, manage budgets, and solve problems in the kitchen."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "8",
      "reason": "Communication with kitchen staff, suppliers, and customers is very important."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "6",
      "reason": "Managing costs and inventory requires some math skills."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "9",
      "reason": "Creating new dishes and improving recipes is a key part of the job."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "7",
      "reason": "Understanding kitchen layout and space management is important for efficiency."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "8",
      "reason": "Working well with a team and handling customer feedback is crucial."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "7",
      "reason": "Knowledge of cooking techniques and kitchen equipment is necessary."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "Keeping the kitchen organized and managing multiple tasks is essential."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "6",
      "reason": "Some chefs may run their own restaurants, requiring business skills."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "8",
      "reason": "Cooking involves a lot of physical work and manual dexterity."
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "8",
      "reason": "Being an Executive Chef involves a lot of hands-on work in the kitchen, preparing and cooking food."
    },
    {
      "attribute": "Investigative",
      "score": "5",
      "reason": "This job requires some problem-solving skills, like creating new recipes and improving kitchen processes, but it is not heavily focused on research or analysis."
    },
    {
      "attribute": "Artistic",
      "score": "9",
      "reason": "Creativity is very important for an Executive Chef. They design menus and create visually appealing dishes."
    },
    {
      "attribute": "Social",
      "score": "7",
      "reason": "Executive Chefs often work with a team and need good communication skills to manage kitchen staff and interact with customers."
    },
    {
      "attribute": "Enterprising",
      "score": "6",
      "reason": "This role involves some leadership and decision-making, especially in managing the kitchen and making business decisions about the menu."
    },
    {
      "attribute": "Conventional",
      "score": "4",
      "reason": "While there are some standard procedures to follow, the job also requires a lot of creativity and flexibility, which is less conventional."
    }
  ],
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "4",
      "reason": "Executive Chefs often work long hours, including nights, weekends, and holidays."
    },
    {
      "attribute": "Achievement",
      "score": "9",
      "reason": "This role allows for creativity and the satisfaction of creating new dishes and menus."
    },
    {
      "attribute": "Independence",
      "score": "7",
      "reason": "Executive Chefs have significant control over kitchen operations and menu planning."
    },
    {
      "attribute": "Recognition",
      "score": "8",
      "reason": "Successful Executive Chefs can gain recognition and awards in the culinary world."
    },
    {
      "attribute": "Supportive Environment",
      "score": "6",
      "reason": "The kitchen environment can be stressful, but teamwork is essential."
    },
    {
      "attribute": "Compensation",
      "score": "7",
      "reason": "Executive Chefs can earn a good salary, especially in high-end restaurants or hotels."
    },
    {
      "attribute": "Security",
      "score": "6",
      "reason": "Job security can vary depending on the restaurant's success and economic conditions."
    }
  ],
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹50,000 - ₹1,00,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹30,000 - ₹70,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹20,000 - ₹40,000"
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Culinary Mastery",
      "description": "This pathway is great for those who love cooking and want to become experts in the kitchen. To succeed, one must constantly learn new recipes and cooking techniques.",
      "jobRoles": [
        {
          "title": "Commis Chef",
          "years": "0-2"
        },
        {
          "title": "Demi Chef de Partie",
          "years": "2-4"
        },
        {
          "title": "Chef de Partie",
          "years": "4-6"
        },
        {
          "title": "Sous Chef",
          "years": "6-8"
        },
        {
          "title": "Executive Chef",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Restaurant Management",
      "description": "This pathway is ideal for those who enjoy both cooking and managing a team. Success comes from strong leadership and good business skills.",
      "jobRoles": [
        {
          "title": "Commis Chef",
          "years": "0-2"
        },
        {
          "title": "Chef de Partie",
          "years": "2-4"
        },
        {
          "title": "Sous Chef",
          "years": "4-6"
        },
        {
          "title": "Head Chef",
          "years": "6-8"
        },
        {
          "title": "Restaurant Manager",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Culinary Innovation",
      "description": "This pathway suits creative individuals who love to experiment with new dishes. Success requires creativity and a passion for food trends.",
      "jobRoles": [
        {
          "title": "Commis Chef",
          "years": "0-2"
        },
        {
          "title": "Junior Sous Chef",
          "years": "2-4"
        },
        {
          "title": "Sous Chef",
          "years": "4-6"
        },
        {
          "title": "Executive Sous Chef",
          "years": "6-8"
        },
        {
          "title": "Executive Chef",
          "years": "8-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Taj Hotels",
        "description": "A luxury hotel chain known for its high-end services and fine dining restaurants.",
        "website": "https://www.tajhotels.com"
      },
      {
        "name": "Oberoi Hotels & Resorts",
        "description": "A group of luxury hotels with a strong focus on personalized service and gourmet cuisine.",
        "website": "https://www.oberoihotels.com"
      },
      {
        "name": "ITC Hotels",
        "description": "A chain of luxury hotels offering a variety of dining experiences and culinary excellence.",
        "website": "https://www.itchotels.com"
      },
      {
        "name": "Leela Palaces, Hotels and Resorts",
        "description": "A luxury hotel group known for its opulent settings and fine dining options.",
        "website": "https://www.theleela.com"
      },
      {
        "name": "Marriott Hotels India",
        "description": "A global hotel chain with a strong presence in India, offering diverse dining experiences.",
        "website": "https://www.marriott.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities like Mumbai, Delhi, and Bangalore, employers are usually high-end hotels, luxury resorts, and upscale restaurants. These employers look for chefs with formal training and experience in international cuisines."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers include boutique hotels, mid-range restaurants, and catering companies. These employers may focus on both local and international cuisines and look for chefs who can manage diverse menus."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are often local hotels, family-owned restaurants, and small catering services. These employers usually prefer chefs who specialize in regional and traditional Indian cuisines."
      }
    ]
  },
  "jobRole": "Executive Chef",
  "jobLocation": "India",
  "sector": "Hospitality & Tourism",
  "subSector": "Food and Beverage Services",
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "experienceLevel": "entry-level",
  "jobRoleKey": "india_hospitality_tourism_food_and_beverage_services_entry_level_college_executive_chef",
  "createdAt": [
    {
      "$date": "2024-08-16T15:43:53.480Z"
    }
  ],
  "updatedAt": [
    {
      "$date": "2024-08-16T15:43:53.480Z"
    }
  ],
  "deleted": false
},
{
  "_id": {
    "$oid": "66c3159945f864a1a47e4a29"
  },
  "collegeCategory": "Non-College",
  "jobRole": "Makeup Artist",
  "jobLocation": "India",
  "sector": "Beauty & Wellness",
  "subSector": "Cosmetics and Skincare",
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "experienceLevel": "entry-level",
  "jobRoleKey": "india_beauty_wellness_cosmetics_and_skincare_entry_level_non_college_makeup_artist",
  "createdAt": [
    {
      "$date": "2024-08-19T15:21:21.398Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-19T15:53:39.680Z"
  },
  "deleted": false,
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "5",
      "reason": "Makeup artists need some logical reasoning to understand client needs and make decisions on product use."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "8",
      "reason": "Good communication is important to understand client preferences and explain makeup procedures."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "3",
      "reason": "Numerical skills are not very important for this job, except for basic calculations related to product quantities."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "10",
      "reason": "Creativity is crucial for makeup artists to create unique and appealing looks."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "7",
      "reason": "Makeup artists need good spatial awareness to apply makeup evenly and symmetrically."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "9",
      "reason": "Strong interpersonal skills help in building a good rapport with clients and understanding their needs."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "6",
      "reason": "Knowledge of makeup products and techniques is important, but can be learned through practice and training."
    },
    {
      "attribute": "Organizational Skills",
      "score": "6",
      "reason": "Keeping makeup tools and products organized is helpful for efficiency and hygiene."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "7",
      "reason": "Many makeup artists work as freelancers or start their own businesses, so entrepreneurial skills are beneficial."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "8",
      "reason": "Good manual dexterity and physical stamina are needed for applying makeup accurately and working long hours."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Freelance Makeup Artist",
      "description": "This pathway is great for those who love flexibility and creativity. Success comes from building a strong client base and showcasing your work on social media.",
      "jobRoles": [
        {
          "title": "Junior Makeup Artist",
          "years": "0-2"
        },
        {
          "title": "Freelance Makeup Artist",
          "years": "2-5"
        },
        {
          "title": "Senior Freelance Makeup Artist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Salon Makeup Artist",
      "description": "This pathway is ideal for those who prefer a stable job with regular clients. Success comes from providing excellent service and building a good reputation in the salon.",
      "jobRoles": [
        {
          "title": "Junior Makeup Artist",
          "years": "0-2"
        },
        {
          "title": "Salon Makeup Artist",
          "years": "2-5"
        },
        {
          "title": "Senior Salon Makeup Artist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Bridal Makeup Specialist",
      "description": "This pathway is perfect for those who enjoy working on special occasions. Success comes from mastering bridal makeup techniques and getting referrals from happy brides.",
      "jobRoles": [
        {
          "title": "Junior Makeup Artist",
          "years": "0-2"
        },
        {
          "title": "Bridal Makeup Artist",
          "years": "2-5"
        },
        {
          "title": "Senior Bridal Makeup Artist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Cosmetics Brand Makeup Artist",
      "description": "This pathway suits those who want to work with big brands. Success comes from understanding the brand's products and providing excellent makeup demonstrations.",
      "jobRoles": [
        {
          "title": "Junior Makeup Artist",
          "years": "0-2"
        },
        {
          "title": "Brand Makeup Artist",
          "years": "2-5"
        },
        {
          "title": "Senior Brand Makeup Artist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Makeup Trainer",
      "description": "This pathway is great for those who love teaching others. Success comes from gaining experience and sharing your knowledge through workshops and classes.",
      "jobRoles": [
        {
          "title": "Junior Makeup Artist",
          "years": "0-2"
        },
        {
          "title": "Makeup Trainer",
          "years": "2-5"
        },
        {
          "title": "Senior Makeup Trainer",
          "years": "5-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Lakmé Salon",
        "description": "A popular chain of beauty salons offering a range of beauty and wellness services.",
        "website": "https://www.lakmeindia.com"
      },
      {
        "name": "VLCC",
        "description": "A well-known wellness and beauty brand providing skincare, haircare, and makeup services.",
        "website": "https://www.vlccwellness.com"
      },
      {
        "name": "Naturals Salon",
        "description": "A leading beauty salon chain with a wide range of beauty and grooming services.",
        "website": "https://www.naturals.in"
      },
      {
        "name": "Jawed Habib Hair & Beauty Salon",
        "description": "A famous salon chain known for hair and beauty services.",
        "website": "https://www.jawedhabib.co.in"
      },
      {
        "name": "Shahnaz Husain Salon",
        "description": "A renowned beauty salon chain offering a variety of beauty treatments.",
        "website": "https://www.shahnaz.in"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually big salon chains, luxury hotels, and high-end spas. They offer a wide range of beauty and wellness services. These employers often have many clients and provide good training and growth opportunities."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often local beauty salons and spas. They may not be as big as those in large cities but still offer a variety of services. These employers may have a steady client base and can provide a good start for a makeup artist."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually small beauty parlors and individual beauty service providers. They may have fewer clients but offer personalized services. These employers can help a makeup artist build strong relationships with clients."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹15,000 - ₹50,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹10,000 - ₹30,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹5,000 - ₹15,000"
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "6",
      "reason": "Makeup Artists work with their hands and tools, but the job is not physically demanding."
    },
    {
      "attribute": "Investigative",
      "score": "3",
      "reason": "This job does not require much research or problem-solving."
    },
    {
      "attribute": "Artistic",
      "score": "9",
      "reason": "Makeup Artists need creativity to design different looks and styles."
    },
    {
      "attribute": "Social",
      "score": "8",
      "reason": "Makeup Artists often interact with clients and need good communication skills."
    },
    {
      "attribute": "Enterprising",
      "score": "7",
      "reason": "Makeup Artists can start their own business or freelance, showing initiative and leadership."
    },
    {
      "attribute": "Conventional",
      "score": "4",
      "reason": "This job does not follow strict routines or procedures, but some organization is needed."
    }
  ],
  "jobProfile": {
    "generalDescription": {
      "text": "A Makeup Artist applies makeup to clients to enhance their appearance. They work with different products like foundation, lipstick, and eyeshadow. They may work for events like weddings, fashion shows, or photo shoots. They also give advice on skincare and beauty routines. Their goal is to make clients look and feel their best."
    },
    "dayInTheLife": {
      "text": "A typical day for a Makeup Artist starts with preparing their tools and products. They meet with clients to understand their needs and preferences. They then apply makeup, which can take from 30 minutes to a few hours depending on the complexity. They may also travel to different locations for work. Throughout the day, they clean their tools and restock their supplies."
    },
    "reasonsLiked": [
      {
        "reason": "Creative freedom to experiment with different looks."
      },
      {
        "reason": "Opportunity to make people feel confident and beautiful."
      },
      {
        "reason": "Flexible working hours and locations."
      },
      {
        "reason": "Chance to work in exciting environments like fashion shows and weddings."
      },
      {
        "reason": "Constantly learning about new products and techniques."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "Long hours, especially during events."
      },
      {
        "reason": "Physical strain from standing for long periods."
      },
      {
        "reason": "Inconsistent income, especially for freelancers."
      },
      {
        "reason": "Need to invest in expensive makeup products and tools."
      },
      {
        "reason": "Dealing with difficult clients can be stressful."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "Typically, a 10th or 12th pass is sufficient. In large cities, higher education might be preferred but not necessary.",
      "trainingNeeded": "Many Makeup Artists attend beauty schools or take certificate courses in makeup artistry. In large cities, diploma programs are also popular.",
      "priorWorkExperience": "Experience can be gained through internships or assisting established makeup artists. In towns and villages, hands-on experience with local beauty parlors is common."
    }
  },
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "7",
      "reason": "Makeup artists often have flexible hours, but may need to work long hours during events or wedding seasons."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "Makeup artists can see immediate results of their work and receive appreciation from clients."
    },
    {
      "attribute": "Independence",
      "score": "9",
      "reason": "Many makeup artists work as freelancers, allowing them to be their own boss and choose their projects."
    },
    {
      "attribute": "Recognition",
      "score": "7",
      "reason": "Makeup artists can build a reputation and gain recognition through social media and client referrals."
    },
    {
      "attribute": "Supportive Environment",
      "score": "6",
      "reason": "The beauty industry can be competitive, but supportive networks and communities do exist."
    },
    {
      "attribute": "Compensation",
      "score": "5",
      "reason": "Entry-level makeup artists may start with modest earnings, but income can increase with experience and reputation."
    },
    {
      "attribute": "Security",
      "score": "5",
      "reason": "Job security can be uncertain for freelancers, but those with a strong client base or working in established salons may have more stability."
    }
  ]
},
{
  "_id": {
    "$oid": "66c32250053a496f19d9ea56"
  },
  "collegeCategory": "Non-College",
  "jobRole": "Police Officer",
  "jobLocation": "India",
  "sector": "Public Administration and Defence",
  "subSector": "Law Enforcement",
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "experienceLevel": "entry-level",
  "jobRoleKey": "india_public_administration_and_defence_law_enforcement_entry_level_non_college_police_officer",
  "createdAt": [
    {
      "$date": "2024-08-19T16:15:36.389Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-19T16:24:08.304Z"
  },
  "deleted": false,
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "8",
      "reason": "Police officers need to solve problems and make quick decisions."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "9",
      "reason": "Police officers must communicate clearly with the public and write reports."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "5",
      "reason": "Basic math skills are needed, but not advanced calculations."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "6",
      "reason": "Sometimes, police officers need to think creatively to solve cases."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "7",
      "reason": "Police officers need to understand their surroundings to stay safe and effective."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "9",
      "reason": "Police officers interact with many people and need to build trust."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "6",
      "reason": "Basic knowledge of technology and equipment is required."
    },
    {
      "attribute": "Organizational Skills",
      "score": "7",
      "reason": "Police officers need to keep records and manage their time well."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "3",
      "reason": "This job does not require starting or running a business."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "10",
      "reason": "Police officers need to be physically fit and handle physical tasks."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Community Policing Specialist",
      "description": "This pathway is attractive for those who want to build strong relationships with the community. Success comes from good communication skills and a caring attitude.",
      "jobRoles": [
        {
          "title": "Police Officer",
          "years": "0-2"
        },
        {
          "title": "Community Liaison Officer",
          "years": "2-5"
        },
        {
          "title": "Community Policing Specialist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Criminal Investigation Expert",
      "description": "This pathway is great for those who enjoy solving puzzles and have a keen eye for detail. Success requires strong analytical skills and persistence.",
      "jobRoles": [
        {
          "title": "Police Officer",
          "years": "0-2"
        },
        {
          "title": "Detective",
          "years": "2-5"
        },
        {
          "title": "Senior Detective",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Traffic Management Specialist",
      "description": "This pathway is ideal for those who are interested in road safety and traffic laws. Success comes from being organized and having good decision-making skills.",
      "jobRoles": [
        {
          "title": "Police Officer",
          "years": "0-2"
        },
        {
          "title": "Traffic Police Officer",
          "years": "2-5"
        },
        {
          "title": "Traffic Management Specialist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Cyber Crime Specialist",
      "description": "This pathway suits those who are tech-savvy and interested in fighting online crime. Success requires strong computer skills and continuous learning.",
      "jobRoles": [
        {
          "title": "Police Officer",
          "years": "0-2"
        },
        {
          "title": "Cyber Crime Investigator",
          "years": "2-5"
        },
        {
          "title": "Cyber Crime Specialist",
          "years": "5-10"
        }
      ]
    },
    {
      "pathwayTitle": "Police Training Instructor",
      "description": "This pathway is perfect for those who enjoy teaching and mentoring new recruits. Success comes from having experience and good teaching skills.",
      "jobRoles": [
        {
          "title": "Police Officer",
          "years": "0-2"
        },
        {
          "title": "Training Officer",
          "years": "2-5"
        },
        {
          "title": "Police Training Instructor",
          "years": "5-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Delhi Police",
        "description": "The primary law enforcement agency for the National Capital Territory of Delhi.",
        "website": "https://www.delhipolice.nic.in/"
      },
      {
        "name": "Mumbai Police",
        "description": "The police department responsible for the city of Mumbai.",
        "website": "https://mumbaipolice.gov.in/"
      },
      {
        "name": "Bangalore City Police",
        "description": "The law enforcement agency for the city of Bangalore.",
        "website": "https://www.bcp.gov.in/"
      },
      {
        "name": "Chennai Police",
        "description": "The police force serving the city of Chennai.",
        "website": "https://www.tnpolice.gov.in/"
      },
      {
        "name": "Kolkata Police",
        "description": "The police department for the city of Kolkata.",
        "website": "http://www.kolkatapolice.gov.in/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, police officers are usually employed by city police departments. These departments have many specialized units and offer various opportunities for career growth."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, police officers work for municipal police departments. These departments are smaller but still offer various roles and responsibilities."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, police officers are often employed by local police stations. These stations have fewer officers and cover larger areas, so officers may have a wider range of duties."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹30,000 - ₹50,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹25,000 - ₹40,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹20,000 - ₹35,000"
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "9",
      "reason": "Police officers often work in real-world settings and deal with practical problems."
    },
    {
      "attribute": "Investigative",
      "score": "8",
      "reason": "Police officers need to investigate crimes and gather evidence."
    },
    {
      "attribute": "Artistic",
      "score": "2",
      "reason": "This job does not usually involve creative or artistic tasks."
    },
    {
      "attribute": "Social",
      "score": "7",
      "reason": "Police officers interact with the community and help people in need."
    },
    {
      "attribute": "Enterprising",
      "score": "6",
      "reason": "Police officers sometimes need to take charge and make quick decisions."
    },
    {
      "attribute": "Conventional",
      "score": "5",
      "reason": "Police work follows set rules and procedures, but it can also be unpredictable."
    }
  ],
  "jobProfile": {
    "generalDescription": {
      "text": "A Police Officer helps keep people safe and enforces the law. They patrol areas, respond to emergencies, and investigate crimes. They also help in maintaining public order and safety. Police Officers work with the community to prevent crime. They also provide assistance during accidents and natural disasters."
    },
    "dayInTheLife": {
      "text": "A typical day for a Police Officer starts with a briefing about any important incidents. They then go on patrol, either on foot or in a vehicle. During patrol, they may stop and question suspicious individuals, respond to emergency calls, and assist in traffic control. They also write reports about incidents they handle. At the end of the day, they may attend meetings or continue investigations."
    },
    "reasonsLiked": [
      {
        "reason": "Helping people and making the community safer."
      },
      {
        "reason": "Variety in daily tasks and not being stuck in an office."
      },
      {
        "reason": "Good job security and benefits."
      },
      {
        "reason": "Opportunities for career advancement."
      },
      {
        "reason": "Respect and recognition from the community."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "High stress and dangerous situations."
      },
      {
        "reason": "Irregular and long working hours."
      },
      {
        "reason": "Exposure to traumatic events."
      },
      {
        "reason": "Dealing with difficult or hostile people."
      },
      {
        "reason": "Physical and mental demands of the job."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "Education Needed",
      "educationVsDegree": "Typically, students need to pass the 12th grade. In some areas, passing the 10th grade may be enough.",
      "trainingNeeded": "Students usually need to complete police training programs. These programs include physical training, law education, and first aid. Some areas may offer special diploma courses.",
      "priorWorkExperience": "No prior work experience is usually needed. However, having experience in security or community service can be helpful."
    }
  },
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "4",
      "reason": "Police officers often work long hours and may have to work nights, weekends, and holidays."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "This job allows you to make a positive impact on your community by maintaining law and order."
    },
    {
      "attribute": "Independence",
      "score": "5",
      "reason": "While there is some independence, police officers must follow strict rules and procedures."
    },
    {
      "attribute": "Recognition",
      "score": "7",
      "reason": "Police officers are often respected and recognized for their service to the community."
    },
    {
      "attribute": "Supportive Environment",
      "score": "6",
      "reason": "There is a sense of camaraderie among police officers, but the job can also be stressful."
    },
    {
      "attribute": "Compensation",
      "score": "6",
      "reason": "The salary is decent, but it may not be as high as some other professions."
    },
    {
      "attribute": "Security",
      "score": "9",
      "reason": "This job offers good job security as there is always a need for law enforcement."
    }
  ]
},
{
  "_id": {
    "$oid": "66c328964b6cd496aee4802b"
  },
  "collegeCategory": "College",
  "jobRole": "Educational Software Developer",
  "jobLocation": "India",
  "sector": "Education, Training & Research",
  "subSector": "Educational Technology",
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "experienceLevel": "entry-level",
  "jobRoleKey": "india_education_training_research_educational_technology_entry_level_college_educational_software_developer",
  "createdAt": [
    {
      "$date": "2024-08-19T16:42:22.007Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-19T16:59:23.141Z"
  },
  "deleted": false,
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "9",
      "reason": "This job requires strong problem-solving skills to develop effective educational software."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "7",
      "reason": "Good communication is needed to understand user requirements and explain technical details."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "6",
      "reason": "Basic math skills are needed for coding and data analysis, but not as much as other skills."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "8",
      "reason": "Creating engaging and effective educational tools requires creativity and new ideas."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "4",
      "reason": "This skill is less important for software development compared to other aptitudes."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "6",
      "reason": "Teamwork and collaboration with educators and other developers are important."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "10",
      "reason": "Strong technical skills in programming and software development are essential."
    },
    {
      "attribute": "Organizational Skills",
      "score": "7",
      "reason": "Managing projects and meeting deadlines requires good organizational skills."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "5",
      "reason": "While not essential, entrepreneurial skills can help in innovating and starting new projects."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "2",
      "reason": "This job mainly involves working on a computer, so physical skills are not important."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Technical Specialist Pathway",
      "description": "This pathway is great for those who love coding and solving technical problems. To succeed, you need to keep learning new programming languages and technologies.",
      "jobRoles": [
        {
          "title": "Junior Software Developer",
          "years": "0-2"
        },
        {
          "title": "Software Developer",
          "years": "2-5"
        },
        {
          "title": "Senior Software Developer",
          "years": "5-8"
        },
        {
          "title": "Technical Lead",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Product Management Pathway",
      "description": "This pathway is ideal for those who enjoy planning and managing projects. To succeed, you need strong communication skills and the ability to understand customer needs.",
      "jobRoles": [
        {
          "title": "Junior Product Manager",
          "years": "0-2"
        },
        {
          "title": "Product Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Product Manager",
          "years": "5-8"
        },
        {
          "title": "Product Director",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Educational Content Specialist Pathway",
      "description": "This pathway is perfect for those who are passionate about education and creating learning materials. To succeed, you need to understand both technology and teaching methods.",
      "jobRoles": [
        {
          "title": "Content Developer",
          "years": "0-2"
        },
        {
          "title": "Senior Content Developer",
          "years": "2-5"
        },
        {
          "title": "Content Manager",
          "years": "5-8"
        },
        {
          "title": "Head of Content",
          "years": "8-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "BYJU'S",
        "description": "BYJU'S is a leading educational technology company in India, known for its learning app and online courses.",
        "website": "https://www.byjus.com"
      },
      {
        "name": "Unacademy",
        "description": "Unacademy is an online learning platform that offers educational content and courses for various competitive exams.",
        "website": "https://unacademy.com"
      },
      {
        "name": "Vedantu",
        "description": "Vedantu is an online tutoring platform that provides live classes and personalized learning for students.",
        "website": "https://www.vedantu.com"
      },
      {
        "name": "Toppr",
        "description": "Toppr is an educational technology company that offers learning apps and online courses for school students.",
        "website": "https://www.toppr.com"
      },
      {
        "name": "Simplilearn",
        "description": "Simplilearn is an online bootcamp that offers professional certification courses and training programs.",
        "website": "https://www.simplilearn.com"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities, employers are usually big educational technology companies or startups. They often have modern offices and a large number of employees. These companies focus on creating and improving educational software and online learning platforms."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often smaller educational technology firms or regional branches of larger companies. They may have fewer employees and a more close-knit work environment. These companies work on local educational needs and software development."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually local educational institutions or small tech firms. They may work on creating educational software for local schools and colleges. These employers often have a small team and focus on community-based educational projects."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹40,000 - ₹80,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹30,000 - ₹60,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹20,000 - ₹40,000"
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "4",
      "reason": "This job involves working with computers and software, but it does not require much physical activity or hands-on work with tools."
    },
    {
      "attribute": "Investigative",
      "score": "8",
      "reason": "This job requires problem-solving skills and a strong understanding of how educational software works, which involves a lot of investigation and analysis."
    },
    {
      "attribute": "Artistic",
      "score": "6",
      "reason": "This job can involve designing user interfaces and creating engaging educational content, which requires some creativity."
    },
    {
      "attribute": "Social",
      "score": "5",
      "reason": "This job may involve some teamwork and communication with educators and students, but it is not primarily focused on social interaction."
    },
    {
      "attribute": "Enterprising",
      "score": "5",
      "reason": "This job may involve some project management and initiative, but it is not primarily focused on business or leadership activities."
    },
    {
      "attribute": "Conventional",
      "score": "7",
      "reason": "This job involves following established procedures and standards in software development, which suits those who prefer structured tasks."
    }
  ],
  "jobProfile": {
    "generalDescription": {
      "text": "An Educational Software Developer creates software for learning. They design and build programs that help students and teachers. They work with educators to understand what is needed. They also test the software to make sure it works well. They fix any problems that come up."
    },
    "dayInTheLife": {
      "text": "A typical day starts with a team meeting to discuss tasks. The developer then writes code for new features or fixes bugs. They might meet with teachers to understand their needs. They test the software to make sure it works correctly. They also review feedback from users and make improvements."
    },
    "reasonsLiked": [
      {
        "reason": "You get to create tools that help people learn."
      },
      {
        "reason": "The job is creative and allows for problem-solving."
      },
      {
        "reason": "You can work with a team of smart people."
      },
      {
        "reason": "The work can be done remotely."
      },
      {
        "reason": "There are always new things to learn in technology."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "The job can be stressful with tight deadlines."
      },
      {
        "reason": "You might have to work long hours sometimes."
      },
      {
        "reason": "Fixing bugs can be frustrating."
      },
      {
        "reason": "You need to keep learning new skills all the time."
      },
      {
        "reason": "The work can be repetitive at times."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Most students get a degree in Computer Science, Software Engineering, or Information Technology.",
      "trainingNeeded": "Additional training in programming languages like Java, Python, or C++ is helpful. Courses in educational technology can also be useful. In large cities, there are many training centers that offer these courses. In smaller cities and towns, online courses are a good option.",
      "priorWorkExperience": "Internships or part-time jobs in software development are common. Experience in educational settings, like working with schools or tutoring, can also be helpful. In large cities, there are more opportunities for internships. In smaller cities and towns, students might need to look for remote internships."
    }
  },
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "7",
      "reason": "Educational Software Developers often have flexible work hours, but deadlines can sometimes require extra hours."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "Creating software that helps students learn can be very rewarding and impactful."
    },
    {
      "attribute": "Independence",
      "score": "6",
      "reason": "While there is some independence in coding, developers often work in teams and follow project guidelines."
    },
    {
      "attribute": "Recognition",
      "score": "5",
      "reason": "Recognition can be limited as the work is often behind the scenes, but successful projects can bring some acknowledgment."
    },
    {
      "attribute": "Supportive Environment",
      "score": "8",
      "reason": "The education sector generally values collaboration and support among team members."
    },
    {
      "attribute": "Compensation",
      "score": "6",
      "reason": "The salary is decent but may not be as high as in other tech sectors."
    },
    {
      "attribute": "Security",
      "score": "7",
      "reason": "There is a steady demand for educational technology, providing good job security."
    }
  ]
},
{
  "_id": {
    "$oid": "66c32f7dceb412a3ef05ce77"
  },
  "collegeCategory": "College",
  "jobRole": "Product Manager",
  "jobLocation": "India",
  "sector": "Telecom/Electronics",
  "subSector": "Consumer Electronics",
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "experienceLevel": "entry-level",
  "jobRoleKey": "india_telecomelectronics_consumer_electronics_entry_level_college_product_manager",
  "createdAt": [
    {
      "$date": "2024-08-19T17:11:49.973Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-19T18:22:51.564Z"
  },
  "deleted": false,
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "9",
      "reason": "Product Managers need to solve complex problems and make data-driven decisions."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "8",
      "reason": "They must communicate effectively with teams, stakeholders, and customers."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "7",
      "reason": "They often analyze data and metrics to guide product decisions."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "8",
      "reason": "They need to come up with new ideas and solutions for products."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "4",
      "reason": "This skill is less critical for Product Managers in Consumer Electronics."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "9",
      "reason": "They work with many different people and need to build good relationships."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "7",
      "reason": "Understanding technical aspects of products is important, but deep technical skills are not always required."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "They must manage timelines, resources, and tasks efficiently."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "7",
      "reason": "They often need to think like entrepreneurs to drive product success."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "3",
      "reason": "This job does not require much physical or manual work."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Product Development Specialist",
      "description": "This pathway is great for those who love creating new products. It attracts creative thinkers who enjoy solving problems and can work well in teams.",
      "jobRoles": [
        {
          "title": "Junior Product Manager",
          "years": "0-2"
        },
        {
          "title": "Product Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Product Manager",
          "years": "5-8"
        },
        {
          "title": "Product Development Lead",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Marketing and Sales Expert",
      "description": "This pathway is ideal for those who enjoy promoting products and interacting with customers. It attracts outgoing people who are good at communication and can understand market trends.",
      "jobRoles": [
        {
          "title": "Junior Product Manager",
          "years": "0-2"
        },
        {
          "title": "Product Marketing Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Marketing Manager",
          "years": "5-8"
        },
        {
          "title": "Head of Marketing",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Operations and Supply Chain Manager",
      "description": "This pathway suits those who like managing processes and ensuring products are delivered on time. It attracts organized individuals who can handle logistics and improve efficiency.",
      "jobRoles": [
        {
          "title": "Junior Product Manager",
          "years": "0-2"
        },
        {
          "title": "Operations Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Operations Manager",
          "years": "5-8"
        },
        {
          "title": "Head of Supply Chain",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Customer Experience Leader",
      "description": "This pathway is perfect for those who want to improve how customers use products. It attracts empathetic people who can listen to customer feedback and make products better.",
      "jobRoles": [
        {
          "title": "Junior Product Manager",
          "years": "0-2"
        },
        {
          "title": "Customer Experience Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Customer Experience Manager",
          "years": "5-8"
        },
        {
          "title": "Head of Customer Experience",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Technical Product Manager",
      "description": "This pathway is great for those who have a strong technical background and want to work closely with engineering teams. It attracts tech-savvy individuals who can understand and translate technical requirements.",
      "jobRoles": [
        {
          "title": "Junior Product Manager",
          "years": "0-2"
        },
        {
          "title": "Technical Product Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Technical Product Manager",
          "years": "5-8"
        },
        {
          "title": "Chief Product Officer",
          "years": "8-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Samsung India",
        "description": "A leading company in consumer electronics and telecom products.",
        "website": "https://www.samsung.com/in/"
      },
      {
        "name": "LG Electronics India",
        "description": "A major player in the consumer electronics market.",
        "website": "https://www.lg.com/in"
      },
      {
        "name": "Sony India",
        "description": "Known for high-quality consumer electronics products.",
        "website": "https://www.sony.co.in/"
      },
      {
        "name": "Xiaomi India",
        "description": "Popular for its affordable and innovative consumer electronics.",
        "website": "https://www.mi.com/in/"
      },
      {
        "name": "Philips India",
        "description": "Offers a wide range of consumer electronics and healthcare products.",
        "website": "https://www.philips.co.in/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities like Mumbai, Delhi, and Bangalore, employers are usually big multinational companies or large Indian corporations. They offer good salaries and benefits. They also provide opportunities for career growth and learning."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often regional companies or smaller branches of larger companies. They may offer fewer benefits compared to large cities but can provide a good work-life balance."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, there are fewer opportunities for this job role. Employers are usually small local businesses or startups. The work environment is more relaxed, but the pay and benefits may be lower."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹50,000 - ₹1,00,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹40,000 - ₹80,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹30,000 - ₹60,000"
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "5",
      "reason": "Product Managers in Consumer Electronics need to understand technical details, but they do not work hands-on with tools or machines."
    },
    {
      "attribute": "Investigative",
      "score": "8",
      "reason": "This job involves a lot of research, data analysis, and problem-solving to improve products and meet consumer needs."
    },
    {
      "attribute": "Artistic",
      "score": "4",
      "reason": "There is some creativity involved in designing product features and user experiences, but it is not the main focus."
    },
    {
      "attribute": "Social",
      "score": "7",
      "reason": "Product Managers often work with teams, communicate with stakeholders, and understand customer feedback."
    },
    {
      "attribute": "Enterprising",
      "score": "9",
      "reason": "This role requires leadership, decision-making, and taking initiative to drive product success in the market."
    },
    {
      "attribute": "Conventional",
      "score": "6",
      "reason": "There are structured processes and standards to follow, but the job also requires flexibility and innovation."
    }
  ],
  "jobProfile": {
    "generalDescription": {
      "text": "A Product Manager in Consumer Electronics in India plans and oversees the development of electronic products. They work with different teams to make sure the product meets customer needs. They also study market trends and competitor products. They set goals and timelines for product development. They ensure the product is launched successfully."
    },
    "dayInTheLife": {
      "text": "A typical day for a Product Manager starts with checking emails and messages. They attend meetings with different teams like engineering, marketing, and sales. They review the progress of ongoing projects and solve any issues that come up. They also spend time researching market trends and customer feedback. In the afternoon, they might work on planning future products or features."
    },
    "reasonsLiked": [
      {
        "reason": "Opportunity to work on cutting-edge technology."
      },
      {
        "reason": "Chance to lead and manage projects."
      },
      {
        "reason": "High demand for skilled professionals in this field."
      },
      {
        "reason": "Good salary and benefits."
      },
      {
        "reason": "Variety in daily tasks and responsibilities."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "High pressure to meet deadlines."
      },
      {
        "reason": "Long working hours."
      },
      {
        "reason": "Need to constantly update skills and knowledge."
      },
      {
        "reason": "Frequent meetings can be tiring."
      },
      {
        "reason": "Balancing different team needs can be challenging."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Most Product Managers have a degree in Engineering, Business, or a related field.",
      "trainingNeeded": "Additional training in project management and market research is helpful. In large cities, specialized courses in product management are common. In medium and small cities, online courses are popular. In towns and villages, self-study and online resources are often used.",
      "priorWorkExperience": "Experience in project management, engineering, or marketing is valuable. In large cities, internships and entry-level jobs in tech companies are common. In medium and small cities, experience in local tech firms or startups is useful. In towns and villages, any relevant work experience is beneficial."
    }
  },
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "6",
      "reason": "Product Managers often have to work extra hours to meet deadlines, but many companies in India are improving work-life balance."
    },
    {
      "attribute": "Achievement",
      "score": "9",
      "reason": "This role allows you to see the direct impact of your work on the product and the market, which can be very rewarding."
    },
    {
      "attribute": "Independence",
      "score": "7",
      "reason": "Product Managers have a good amount of independence in making decisions, but they still need to collaborate with other teams."
    },
    {
      "attribute": "Recognition",
      "score": "8",
      "reason": "Successful product launches and improvements often lead to recognition within the company."
    },
    {
      "attribute": "Supportive Environment",
      "score": "7",
      "reason": "Most companies provide a supportive environment, but the level of support can vary."
    },
    {
      "attribute": "Compensation",
      "score": "8",
      "reason": "Product Managers in the Telecom/Electronics sector are generally well-compensated, especially in consumer electronics."
    },
    {
      "attribute": "Security",
      "score": "7",
      "reason": "The job market for Product Managers is stable, but it can be competitive. Companies value experienced professionals."
    }
  ]
},
{
  "_id": {
    "$oid": "66c32f80ceb412a3ef05ce78"
  },
  "collegeCategory": "College",
  "jobRole": "Marketing Manager",
  "jobLocation": "India",
  "sector": "Telecom/Electronics",
  "subSector": "Consumer Electronics",
  "generatedBy": "OpenAI GPT-4o",
  "languageCode": "en",
  "experienceLevel": "entry-level",
  "jobRoleKey": "india_telecomelectronics_consumer_electronics_entry_level_college_marketing_manager",
  "createdAt": [
    {
      "$date": "2024-08-19T17:11:52.172Z"
    }
  ],
  "updatedAt": {
    "$date": "2024-08-19T18:23:54.992Z"
  },
  "deleted": false,
  "aptitudeRatings": [
    {
      "attribute": "Logical Reasoning and Analytical Skills",
      "score": "8",
      "reason": "Marketing Managers need to analyze market trends and consumer data to make informed decisions."
    },
    {
      "attribute": "Verbal Ability and Communication Skills",
      "score": "9",
      "reason": "Effective communication is crucial for creating marketing strategies and working with teams."
    },
    {
      "attribute": "Numerical Aptitude",
      "score": "7",
      "reason": "Understanding budgets, sales figures, and market research data is important."
    },
    {
      "attribute": "Creative Thinking and Innovation",
      "score": "8",
      "reason": "Developing unique marketing campaigns requires creativity and new ideas."
    },
    {
      "attribute": "Spatial Awareness",
      "score": "4",
      "reason": "This skill is less relevant for a Marketing Manager in Consumer Electronics."
    },
    {
      "attribute": "Interpersonal Skills",
      "score": "9",
      "reason": "Building relationships with clients, teams, and stakeholders is key."
    },
    {
      "attribute": "Technical Proficiency",
      "score": "6",
      "reason": "Basic understanding of electronics and telecom products can be helpful."
    },
    {
      "attribute": "Organizational Skills",
      "score": "8",
      "reason": "Managing multiple projects and deadlines requires strong organizational abilities."
    },
    {
      "attribute": "Entrepreneurial Skills",
      "score": "7",
      "reason": "Innovative thinking and risk-taking can drive successful marketing strategies."
    },
    {
      "attribute": "Physical and Manual Skills",
      "score": "3",
      "reason": "This job is more focused on mental tasks rather than physical labor."
    }
  ],
  "careerPathways": [
    {
      "pathwayTitle": "Brand Management Specialist",
      "description": "This pathway is great for those who love creating and managing brand images. Employees who are creative and strategic can excel here by developing strong marketing campaigns.",
      "jobRoles": [
        {
          "title": "Marketing Manager",
          "years": "0-2"
        },
        {
          "title": "Senior Marketing Manager",
          "years": "2-5"
        },
        {
          "title": "Brand Manager",
          "years": "5-8"
        },
        {
          "title": "Senior Brand Manager",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Digital Marketing Expert",
      "description": "This pathway is ideal for those who enjoy working with online platforms and data. Employees who are tech-savvy and analytical can succeed by mastering digital tools and strategies.",
      "jobRoles": [
        {
          "title": "Marketing Manager",
          "years": "0-2"
        },
        {
          "title": "Digital Marketing Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Digital Marketing Manager",
          "years": "5-8"
        },
        {
          "title": "Head of Digital Marketing",
          "years": "8-10"
        }
      ]
    },
    {
      "pathwayTitle": "Product Marketing Leader",
      "description": "This pathway suits those who are passionate about products and their market fit. Employees who are detail-oriented and customer-focused can thrive by aligning products with market needs.",
      "jobRoles": [
        {
          "title": "Marketing Manager",
          "years": "0-2"
        },
        {
          "title": "Product Marketing Manager",
          "years": "2-5"
        },
        {
          "title": "Senior Product Marketing Manager",
          "years": "5-8"
        },
        {
          "title": "Director of Product Marketing",
          "years": "8-10"
        }
      ]
    }
  ],
  "employers": {
    "wellKnownEmployers": [
      {
        "name": "Samsung India",
        "description": "A leading consumer electronics company known for its wide range of products including smartphones, TVs, and home appliances.",
        "website": "https://www.samsung.com/in/"
      },
      {
        "name": "LG Electronics India",
        "description": "A major player in the consumer electronics market, offering products like TVs, refrigerators, and washing machines.",
        "website": "https://www.lg.com/in"
      },
      {
        "name": "Sony India",
        "description": "A well-known brand for its high-quality electronics such as cameras, audio systems, and gaming consoles.",
        "website": "https://www.sony.co.in/"
      },
      {
        "name": "Panasonic India",
        "description": "Offers a wide range of consumer electronics including home appliances, personal care products, and audio-visual equipment.",
        "website": "https://www.panasonic.com/in/"
      },
      {
        "name": "Philips India",
        "description": "Known for its innovative products in healthcare, lighting, and consumer electronics.",
        "website": "https://www.philips.co.in/"
      }
    ],
    "employerProfiles": [
      {
        "geographicOption": "Large Cities",
        "profiles": "In large cities like Mumbai, Delhi, and Bangalore, employers are usually big multinational companies or large Indian firms. They often have large offices and many employees. These companies offer good salaries and benefits."
      },
      {
        "geographicOption": "Medium & Small Cities",
        "profiles": "In medium and small cities, employers are often regional offices of big companies or well-established local businesses. They may not be as large as those in big cities but still offer good opportunities and decent pay."
      },
      {
        "geographicOption": "Towns & Villages",
        "profiles": "In towns and villages, employers are usually small local businesses or regional distributors. These jobs may offer lower salaries compared to big cities but can provide a good start and experience in the field."
      }
    ]
  },
  "geographicJobDetails": [
    {
      "geographicOption": "Large Cities",
      "jobAvailability": "High",
      "estimatedSalaryRange": "₹50,000 - ₹1,00,000"
    },
    {
      "geographicOption": "Medium & Small Cities",
      "jobAvailability": "Medium",
      "estimatedSalaryRange": "₹30,000 - ₹60,000"
    },
    {
      "geographicOption": "Towns & Villages",
      "jobAvailability": "Low to None",
      "estimatedSalaryRange": "₹20,000 - ₹40,000"
    }
  ],
  "interestRatings": [
    {
      "attribute": "Realistic",
      "score": "4",
      "reason": "This job involves some practical tasks like market research, but it is mostly focused on planning and strategy."
    },
    {
      "attribute": "Investigative",
      "score": "6",
      "reason": "This job requires analyzing market trends and consumer behavior, which involves some investigative work."
    },
    {
      "attribute": "Artistic",
      "score": "5",
      "reason": "There is some creativity involved in designing marketing campaigns, but it is not the main focus."
    },
    {
      "attribute": "Social",
      "score": "8",
      "reason": "This job involves a lot of interaction with people, including customers, team members, and other departments."
    },
    {
      "attribute": "Enterprising",
      "score": "9",
      "reason": "This job is highly enterprising as it involves leading projects, making decisions, and taking risks to achieve business goals."
    },
    {
      "attribute": "Conventional",
      "score": "7",
      "reason": "This job requires following established procedures and working within a structured environment, but also allows for some flexibility."
    }
  ],
  "jobProfile": {
    "generalDescription": {
      "text": "A Marketing Manager in the Telecom/Electronics sector focuses on promoting consumer electronics products. They plan marketing campaigns, analyze market trends, and work with sales teams. They also manage budgets and coordinate with advertising agencies. Their goal is to increase product sales and brand awareness."
    },
    "dayInTheLife": {
      "text": "A typical day starts with checking emails and reviewing sales reports. They might have meetings with the sales team to discuss strategies. They spend time planning marketing campaigns and creating promotional materials. They also analyze market data to understand consumer preferences. The day often ends with coordinating with advertising agencies and setting budgets."
    },
    "reasonsLiked": [
      {
        "reason": "Creative work environment."
      },
      {
        "reason": "Opportunities to work with new technology."
      },
      {
        "reason": "High potential for career growth."
      },
      {
        "reason": "Interaction with different teams and departments."
      },
      {
        "reason": "Challenging and dynamic work."
      }
    ],
    "reasonsDisliked": [
      {
        "reason": "High-pressure deadlines."
      },
      {
        "reason": "Long working hours."
      },
      {
        "reason": "Frequent changes in market trends."
      },
      {
        "reason": "Need to manage multiple tasks at once."
      },
      {
        "reason": "High expectations from management."
      }
    ],
    "prepareForRole": {
      "educationVsDegreeHeading": "College Degree Needed",
      "educationVsDegree": "Students typically need a degree in Marketing, Business Administration, or a related field.",
      "trainingNeeded": "Additional training in digital marketing, market research, and data analysis is helpful. In large cities, specialized marketing courses are more common. In medium and small cities, online courses are popular. In towns and villages, local workshops might be available.",
      "priorWorkExperience": "Internships in marketing or sales are common. In large cities, experience with big companies is valued. In medium and small cities, experience with local businesses is common. In towns and villages, any marketing experience is useful."
    }
  },
  "valueRatings": [
    {
      "attribute": "Work-Life Balance",
      "score": "6",
      "reason": "Marketing Managers often have to work extra hours, especially during product launches, but some companies offer flexible schedules."
    },
    {
      "attribute": "Achievement",
      "score": "8",
      "reason": "This role allows you to see the direct impact of your work on sales and brand growth, which can be very rewarding."
    },
    {
      "attribute": "Independence",
      "score": "7",
      "reason": "Marketing Managers have some freedom to make decisions and plan campaigns, but they still need to align with company goals."
    },
    {
      "attribute": "Recognition",
      "score": "7",
      "reason": "Successful campaigns can bring recognition within the company and industry, but not always publicly."
    },
    {
      "attribute": "Supportive Environment",
      "score": "6",
      "reason": "The work environment can be competitive, but teamwork is also important for success."
    },
    {
      "attribute": "Compensation",
      "score": "8",
      "reason": "Marketing Managers in the telecom/electronics sector are generally well-paid, especially with experience."
    },
    {
      "attribute": "Security",
      "score": "7",
      "reason": "The telecom and consumer electronics sectors are growing, offering good job security, but market changes can affect stability."
    }
  ]
}]